ra-rs/ra/svd/vendor/R7FA8M1AH.svd
                <register>
                    <dim>4</dim>
                    <dimIncrement>0x8</dimIncrement>
                    <dimIndex>0-3</dimIndex>
                    <name>QOSCYC%s</name>
                    <description>QoS Cycle Setting Register %s</description>
                    <addressOffset>0x1410</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>QOSCYC</name>
                            <description>QoS Unit Cycle Setting</description>
                            <lsb>0</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0000000000000000</name>
                                    <description>QoS circuit is disabled.</description>
                                    <value>#0000000000000000</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0000000000000001</name>
                                    <description>QoS unit cycle is 16</description>
                                    <value>#0000000000000001</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0000000000000010</name>
                                    <description>QoS unit cycle is 32</description>
                                    <value>#0000000000000010</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0000000000000011</name>
                                    <description>QoS unit cycle is 48</description>
                                    <value>#0000000000000011</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1111111111111111</name>
                                    <description>QoS unit cycle is 1,048,560</description>
                                    <value>#1111111111111111</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>These bits are read as 0000000000000000. The write value should be 0000000000000000.</description>
                            <lsb>16</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>BUSMPRI</name>
                    <description>Bus Master priority setting register</description>
                    <addressOffset>0x1430</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>PRI</name>
                            <description>Priority Select</description>
                            <lsb>0</lsb>
                            <msb>3</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0000</name>
                                    <description>Priority of MIPI is MIDDLE</description>
                                    <value>#0000</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1111</name>
                                    <description>Priority of MIPI is LOW</description>
                                    <value>#1111</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>These bits are read as 000000000000. The write value should be 000000000000.</description>
                            <lsb>4</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>These bits are read as 0000000000000000. The write value should be 0000000000000000.</description>
                            <lsb>16</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>QOSCYC4</name>
                    <description>QoS Cycle Setting Register 4</description>
                    <addressOffset>0x1438</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>QOSCYC</name>
                            <description>QoS Unit Cycle Setting</description>
                            <lsb>0</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0000000000000000</name>
                                    <description>QoS circuit is disabled.</description>
                                    <value>#0000000000000000</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0000000000000001</name>
                                    <description>QoS unit cycle is 16</description>
                                    <value>#0000000000000001</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0000000000000010</name>
                                    <description>QoS unit cycle is 32</description>
                                    <value>#0000000000000010</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0000000000000011</name>
                                    <description>QoS unit cycle is 48</description>
                                    <value>#0000000000000011</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1111111111111111</name>
                                    <description>QoS unit cycle is 1,048,560</description>
                                    <value>#1111111111111111</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>These bits are read as 0000000000000000. The write value should be 0000000000000000.</description>
                            <lsb>16</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>4</dim>
                    <dimIncrement>0x8</dimIncrement>
                    <dimIndex>0-3</dimIndex>
                    <name>QOSTHD%s</name>
                    <description>QoS Threshold Setting Register %s</description>
                    <addressOffset>0x1500</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>QOSTHD</name>
                            <description>QoS Threshold Setting</description>
                            <lsb>0</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0000000000000000</name>
                                    <description>Threshold is 0 byte</description>
                                    <value>#0000000000000000</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0000000000000001</name>
                                    <description>Threshold is 1 byte</description>
                                    <value>#0000000000000001</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0000000000000010</name>
                                    <description>Threshold is 2 bytes</description>
                                    <value>#0000000000000010</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0000000000000011</name>
                                    <description>Threshold is 3 bytes</description>
                                    <value>#0000000000000011</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1111111111111111</name>
                                    <description>Threshold is 65,535 bytes</description>
                                    <value>#1111111111111111</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>These bits are read as 0000000000000000. The write value should be 0000000000000000.</description>
                            <lsb>16</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>QOSTHD4</name>
                    <description>QoS Threshold Setting Register 4</description>
                    <addressOffset>0x1528</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>QOSTHD</name>
                            <description>QoS Threshold Setting</description>
                            <lsb>0</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0000000000000000</name>
                                    <description>Threshold is 0 byte</description>
                                    <value>#0000000000000000</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0000000000000001</name>
                                    <description>Threshold is 1 byte</description>
                                    <value>#0000000000000001</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0000000000000010</name>
                                    <description>Threshold is 2 bytes</description>
                                    <value>#0000000000000010</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0000000000000011</name>
                                    <description>Threshold is 3 bytes</description>
                                    <value>#0000000000000011</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1111111111111111</name>
                                    <description>Threshold is 65,535 bytes</description>
                                    <value>#1111111111111111</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>These bits are read as 0000000000000000. The write value should be 0000000000000000.</description>
                            <lsb>16</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>4</dim>
                    <dimIncrement>0x8</dimIncrement>
                    <dimIndex>0-3</dimIndex>
                    <name>QOSDMON%s</name>
                    <description>QoS Data Transferred Amount Monitor Register %s</description>
                    <addressOffset>0x1600</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>QOSDMON</name>
                            <description>QoS data transferred amount within a unit cycle</description>
                            <lsb>0</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0000000000000000</name>
                                    <description>0 byte</description>
                                    <value>#0000000000000000</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0000000000000001</name>
                                    <description>1 byte</description>
                                    <value>#0000000000000001</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0000000000000010</name>
                                    <description>2 bytes</description>
                                    <value>#0000000000000010</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0000000000000011</name>
                                    <description>3 bytes</description>
                                    <value>#0000000000000011</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1111111111111111</name>
                                    <description>65,535 or more bytes.</description>
                                    <value>#1111111111111111</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>These bits are read as 0000000000000000. The write value should be 0000000000000000.</description>
                            <lsb>16</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>QOSDMON4</name>
                    <description>QoS Data Transferred Amount Monitor Register 4</description>
                    <addressOffset>0x1628</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>QOSDMON</name>
                            <description>QoS data transferred amount within a unit cycle</description>
                            <lsb>0</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0000000000000000</name>
                                    <description>0 byte</description>
                                    <value>#0000000000000000</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0000000000000001</name>
                                    <description>1 byte</description>
                                    <value>#0000000000000001</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0000000000000010</name>
                                    <description>2 bytes</description>
                                    <value>#0000000000000010</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0000000000000011</name>
                                    <description>3 bytes</description>
                                    <value>#0000000000000011</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1111111111111111</name>
                                    <description>65,535 or more bytes.</description>
                                    <value>#1111111111111111</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>These bits are read as 0000000000000000. The write value should be 0000000000000000.</description>
                            <lsb>16</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>6</dim>
                    <dimIncrement>0x10</dimIncrement>
                    <dimIndex>4-9</dimIndex>
                    <name>BUS%sERRADD</name>
                    <description>Bus Error Address Register %s</description>
                    <addressOffset>0x1830</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x00000000</resetMask>
                    <fields>
                        <field>
                            <name>BERAD</name>
                            <description>Bus Error AddressWhen a bus error occurs, It stores an error address.</description>
                            <lsb>0</lsb>
                            <msb>31</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>6</dim>
                    <dimIncrement>0x10</dimIncrement>
                    <dimIndex>4-9</dimIndex>
                    <name>BUS%sERRRW</name>
                    <description>Bus Error RW Register %s</description>
                    <addressOffset>0x1834</addressOffset>
                    <size>8</size>
                    <access>read-only</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0x01</resetMask>
                    <fields>
                        <field>
                            <name>RWSTAT</name>
                            <description>error access Read/Write STAtus</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Read access</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Write access</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>These bits are read as 0000000.</description>
                            <lsb>1</lsb>
                            <msb>7</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
