ra-rs/ra/svd/vendor/R7FA8M1AH.svd
            </registers>
        </peripheral>
        <peripheral>
            <name>CPU_DBG</name>
            <description>Debug Function</description>
            <baseAddress>0x4001B000</baseAddress>
            <addressBlock>
                <offset>0x00</offset>
                <size>4</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x10</offset>
                <size>4</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x20</offset>
                <size>8</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x30</offset>
                <size>8</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x40</offset>
                <size>4</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x100</offset>
                <size>4</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x200</offset>
                <size>4</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x300</offset>
                <size>4</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x310</offset>
                <size>4</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <name>DBGSTR</name>
                    <description>Debug Status Register</description>
                    <addressOffset>0x000</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xCFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>Reserved</name>
                            <description>These bits are read as 0000000000000000000000000000.</description>
                            <lsb>0</lsb>
                            <msb>27</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>CDBGPWRUPREQ</name>
                            <description>Debug power-up request</description>
                            <lsb>28</lsb>
                            <msb>28</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>OCD is not requesting debug power-up</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>OCD is requesting debug power-up</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>CDBGPWRUPACK</name>
                            <description>Debug power-up acknowledge</description>
                            <lsb>29</lsb>
                            <msb>29</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Debug power-up request is not acknowledged</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Debug power-up request is acknowledged</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>These bits are read as 00.</description>
                            <lsb>30</lsb>
                            <msb>31</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DBGSTOPCR</name>
                    <description>Debug Stop Control Register</description>
                    <addressOffset>0x010</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000003</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>DBGSTOP_IWDT</name>
                            <description>Mask bit for IWDT reset/interrupt in the OCD run modeIn the OCD break mode, the reset/interrupt is masked and IWDT counter is stopped, regardless of this bit value.</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Enable IWDT reset/interrupt</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Mask IWDT reset/interrupt and stop IWDT counter</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>DBGSTOP_WDT0</name>
                            <description>Mask bit for WDT0 reset/interrupt in the OCD run modeIn the OCD break mode, the reset/interrupt is masked and WDT0 counter is stopped, regardless of this bit value.</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Enable WDT0 reset/interrupt</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Mask WDT0 reset/interrupt and stop WDT0 counter</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>These bits are read as 00000000000000. The write value should be 00000000000000.</description>
                            <lsb>2</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>This bit is read as 0. The write value should be 0.</description>
                            <lsb>16</lsb>
                            <msb>16</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DBGSTOP_PVD</name>
                            <description>Mask bit for PVDn (n!=0) reset/interrupt</description>
                            <lsb>17</lsb>
                            <msb>17</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Enable PVDn (n!=0) reset/interrupt</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Mask PVDn (n!=0) reset/interrupt</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>These bits are read as 0000000000000. The write value should be 0000000000000.</description>
                            <lsb>18</lsb>
                            <msb>30</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>This bit is read as 0. The write value should be 0.</description>
                            <lsb>31</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DBGAUTH0</name>
                    <description>Debug Authentication Control Register 0</description>
                    <addressOffset>0x020</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>DBGEN0</name>
                            <description>CPU0 invasive debug enable</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Disabled</description>
                                    <value>#1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Enabled</description>
                                    <value>#0</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>These bits are read as 000. The write value should be 000.</description>
                            <lsb>1</lsb>
                            <msb>3</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>NIDEN0</name>
                            <description>CPU0 non-invasive debug enable</description>
                            <lsb>4</lsb>
                            <msb>4</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Disabled</description>
                                    <value>#1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Enabled</description>
                                    <value>#0</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>These bits are read as 000. The write value should be 000.</description>
                            <lsb>5</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DBGENAP0</name>
                            <description>CPU0 AHB-AP (AP0) debug enable</description>
                            <lsb>8</lsb>
                            <msb>8</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Disabled</description>
                                    <value>#1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Enabled</description>
                                    <value>#0</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>These bits are read as 0000000. The write value should be 0000000.</description>
                            <lsb>9</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DEVICEEN</name>
                            <description>APB-AP (AP1) authentication</description>
                            <lsb>16</lsb>
                            <msb>16</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Disabled</description>
                                    <value>#1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Enabled</description>
                                    <value>#0</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>These bits are read as 00000000000000. The write value should be 00000000000000.</description>
                            <lsb>17</lsb>
                            <msb>30</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SWDBG</name>
                            <description>Software control of debug function</description>
                            <lsb>31</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Disabled</description>
                                    <value>#1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Enabled</description>
                                    <value>#0</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DBGAUTH1</name>
                    <description>Debug Authentication Control Register 1</description>
                    <addressOffset>0x024</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>Reserved</name>
                            <description>These bits are read as 00000000. The write value should be 00000000.</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SPIDENAP0</name>
                            <description>CPU0 AHB-AP (AP0) debug enable</description>
                            <lsb>8</lsb>
                            <msb>8</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Disabled</description>
                                    <value>#1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Enabled</description>
                                    <value>#0</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>These bits are read as 0000000. The write value should be 0000000.</description>
                            <lsb>9</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>These bits are read as 0000000000000000. The write value should be 0000000000000000.</description>
                            <lsb>16</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
