ra-rs/ra/svd/vendor/R7FA8M1AH.svd
                                    <name>0010</name>
                                    <description>/4</description>
                                    <value>#0010</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0011</name>
                                    <description>/8</description>
                                    <value>#0011</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0100</name>
                                    <description>/16</description>
                                    <value>#0100</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0101</name>
                                    <description>/32</description>
                                    <value>#0101</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0110</name>
                                    <description>/64</description>
                                    <value>#0110</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1000</name>
                                    <description>/3</description>
                                    <value>#1000</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1001</name>
                                    <description>/6</description>
                                    <value>#1001</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1010</name>
                                    <description>/12</description>
                                    <value>#1010</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>FCK</name>
                            <description>Flash IF Clock (FCLK) Select</description>
                            <lsb>28</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0000</name>
                                    <description>/1 (value after reset)</description>
                                    <value>#0000</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0001</name>
                                    <description>/2</description>
                                    <value>#0001</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0010</name>
                                    <description>/4</description>
                                    <value>#0010</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0011</name>
                                    <description>/8</description>
                                    <value>#0011</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0100</name>
                                    <description>/16</description>
                                    <value>#0100</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0101</name>
                                    <description>/32</description>
                                    <value>#0101</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0110</name>
                                    <description>/64</description>
                                    <value>#0110</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1000</name>
                                    <description>/3</description>
                                    <value>#1000</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1001</name>
                                    <description>/6</description>
                                    <value>#1001</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1010</name>
                                    <description>/12</description>
                                    <value>#1010</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SCKDIVCR2</name>
                    <description>System Clock Division Control Register 2</description>
                    <addressOffset>0x024</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>CPUCK</name>
                            <description>CPU Clock (CPUCLK) Select</description>
                            <lsb>0</lsb>
                            <msb>3</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0000</name>
                                    <description>/1 (value after reset)</description>
                                    <value>#0000</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0001</name>
                                    <description>/2</description>
                                    <value>#0001</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0010</name>
                                    <description>/4</description>
                                    <value>#0010</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0011</name>
                                    <description>/8</description>
                                    <value>#0011</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0100</name>
                                    <description>/16</description>
                                    <value>#0100</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0101</name>
                                    <description>/32</description>
                                    <value>#0101</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0110</name>
                                    <description>/64</description>
                                    <value>#0110</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1000</name>
                                    <description>/3</description>
                                    <value>#1000</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1001</name>
                                    <description>/6</description>
                                    <value>#1001</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1010</name>
                                    <description>/12</description>
                                    <value>#1010</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>These bits are read as 0. The write value should be 0.</description>
                            <lsb>4</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SCKSCR</name>
                    <description>System Clock Source Control Register</description>
                    <addressOffset>0x026</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x01</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>CKSEL</name>
                            <description>Clock Source Select</description>
                            <lsb>0</lsb>
                            <msb>2</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>000</name>
                                    <description>HOCO </description>
                                    <value>#000</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>001</name>
                                    <description>MOCO</description>
                                    <value>#001</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>011</name>
                                    <description>Main clock oscillator </description>
                                    <value>#011</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>100</name>
                                    <description>Sub-clock oscillator </description>
                                    <value>#100</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>101</name>
                                    <description>PLL</description>
                                    <value>#101</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>These bits are read as 00000. The write value should be 00000.</description>
                            <lsb>3</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PLLCCR</name>
                    <description>PLL Clock Control Register</description>
                    <addressOffset>0x028</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x1300</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>PLIDIV</name>
                            <description>PLL1 Input Frequency Division Ratio Select</description>
                            <lsb>0</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>00</name>
                                    <description>/1 </description>
                                    <value>#00</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>01</name>
                                    <description>/2</description>
                                    <value>#01</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>10</name>
                                    <description>/3</description>
                                    <value>#10</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>11</name>
                                    <description>Setting prohibited</description>
                                    <value>#11</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>These bits are read as 00. The write value should be 00.</description>
                            <lsb>2</lsb>
                            <msb>3</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PLSRCSEL</name>
                            <description>PLL1 Clock Source Select</description>
                            <lsb>4</lsb>
                            <msb>4</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Main clock oscillator</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>HOCO</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>This bit is read as 0. The write value should be 0.</description>
                            <lsb>5</lsb>
                            <msb>5</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PLLMULNF</name>
                            <description>PLL1 Frequency Multiplication Fractional Factor Select</description>
                            <lsb>6</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>00</name>
                                    <description>0.00 (Value after reset)</description>
                                    <value>#00</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>01</name>
                                    <description>0.33 (1/3)</description>
                                    <value>#01</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>10</name>
                                    <description>0.66 (2/3)</description>
                                    <value>#10</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>11</name>
                                    <description>0.50 (1/2)</description>
                                    <value>#11</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>PLLMUL</name>
                            <description>PLL1 Frequency Multiplication Factor Select</description>
                            <lsb>8</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>00011001</name>
                                    <description>×26 (Value after reset)</description>
                                    <value>#00011001</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>00011010</name>
                                    <description>×27</description>
                                    <value>#00011010</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>00011011</name>
                                    <description>×28</description>
                                    <value>#00011011</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>01011000</name>
                                    <description>×89</description>
                                    <value>#01011000</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>01011001</name>
                                    <description>×90</description>
                                    <value>#01011001</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>01011010</name>
                                    <description>×91</description>
                                    <value>#01011010</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>10110010</name>
                                    <description>×179</description>
                                    <value>#10110010</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>10110011</name>
                                    <description>×180</description>
                                    <value>#10110011</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PLLCR</name>
                    <description>PLL Control Register</description>
                    <addressOffset>0x02A</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x01</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>PLLSTP</name>
                            <description>PLL1 Stop Control</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Operate the PLL1</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Stop the PLL1</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>These bits are read as 0000000. The write value should be 0000000.</description>
                            <lsb>1</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
