ra-rs/ra/svd/vendor/R7FA8M1AH.svd
                <register>
                    <name>ELCPARA</name>
                    <description>Event Link Controller Priviledge Attribution Register A</description>
                    <addressOffset>0xF0</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0xFFFFFFFF</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>ELCR</name>
                            <description>Event Link Controller RegisterPriviledge Attribution</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Priviledge</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>AnyPriviledge</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>ELSEGR0</name>
                            <description>Event Link Software Event Generation Register 0Priviledge Attribution</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Priviledge</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>AnyPriviledge</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>ELSEGR1</name>
                            <description>Event Link Software Event Generation Register 1Priviledge Attribution</description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Priviledge</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>AnyPriviledge</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>These bits are read as 1111111111111. The write value should be 1111111111111.</description>
                            <lsb>3</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>These bits are read as 1111111111111111. The write value should be 1111111111111111.</description>
                            <lsb>16</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ELCPARB</name>
                    <description>Event Link Controller Priviledge Attribution Register B</description>
                    <addressOffset>0xF4</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0xFFFFFFFF</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>ELSR0</name>
                            <description>Event Link Setting Register 0Priviledge Attribution</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Priviledge</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>AnyPriviledge</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>ELSR1</name>
                            <description>Event Link Setting Register 1Priviledge Attribution</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Priviledge</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>AnyPriviledge</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>ELSR2</name>
                            <description>Event Link Setting Register 2Priviledge Attribution</description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Priviledge</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>AnyPriviledge</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>ELSR3</name>
                            <description>Event Link Setting Register 3Priviledge Attribution</description>
                            <lsb>3</lsb>
                            <msb>3</msb>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Priviledge</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>AnyPriviledge</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>ELSR4</name>
                            <description>Event Link Setting Register 4Priviledge Attribution</description>
                            <lsb>4</lsb>
                            <msb>4</msb>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Priviledge</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>AnyPriviledge</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>ELSR5</name>
                            <description>Event Link Setting Register 5Priviledge Attribution</description>
                            <lsb>5</lsb>
                            <msb>5</msb>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Priviledge</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>AnyPriviledge</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>ELSR6</name>
                            <description>Event Link Setting Register 6Priviledge Attribution</description>
                            <lsb>6</lsb>
                            <msb>6</msb>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Priviledge</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>AnyPriviledge</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>ELSR7</name>
                            <description>Event Link Setting Register 7Priviledge Attribution</description>
                            <lsb>7</lsb>
                            <msb>7</msb>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Priviledge</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>AnyPriviledge</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>ELSR8</name>
                            <description>Event Link Setting Register 8Priviledge Attribution</description>
                            <lsb>8</lsb>
                            <msb>8</msb>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Priviledge</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>AnyPriviledge</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>ELSR9</name>
                            <description>Event Link Setting Register 9Priviledge Attribution</description>
                            <lsb>9</lsb>
                            <msb>9</msb>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Priviledge</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>AnyPriviledge</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>ELSR10</name>
                            <description>Event Link Setting Register 10Priviledge Attribution</description>
                            <lsb>10</lsb>
                            <msb>10</msb>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Priviledge</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>AnyPriviledge</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>ELSR11</name>
                            <description>Event Link Setting Register 11Priviledge Attribution</description>
                            <lsb>11</lsb>
                            <msb>11</msb>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Priviledge</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>AnyPriviledge</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>ELSR12</name>
                            <description>Event Link Setting Register 12Priviledge Attribution</description>
                            <lsb>12</lsb>
                            <msb>12</msb>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Priviledge</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>AnyPriviledge</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>ELSR13</name>
                            <description>Event Link Setting Register 13Priviledge Attribution</description>
                            <lsb>13</lsb>
                            <msb>13</msb>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Priviledge</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>AnyPriviledge</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>ELSR14</name>
                            <description>Event Link Setting Register 14Priviledge Attribution</description>
                            <lsb>14</lsb>
                            <msb>14</msb>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Priviledge</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>AnyPriviledge</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>ELSR15</name>
                            <description>Event Link Setting Register 15Priviledge Attribution</description>
                            <lsb>15</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Priviledge</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>AnyPriviledge</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>ELSR16</name>
                            <description>Event Link Setting Register 16Priviledge Attribution</description>
                            <lsb>16</lsb>
                            <msb>16</msb>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Priviledge</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>AnyPriviledge</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>ELSR17</name>
                            <description>Event Link Setting Register 17Priviledge Attribution</description>
                            <lsb>17</lsb>
                            <msb>17</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Priviledge</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>AnyPriviledge</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>This bit is read as 1. The write value should be 1.</description>
                            <lsb>18</lsb>
                            <msb>18</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>This bit is read as 1. The write value should be 1.</description>
                            <lsb>19</lsb>
                            <msb>19</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>This bit is read as 1. The write value should be 1.</description>
                            <lsb>20</lsb>
                            <msb>20</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>This bit is read as 1. The write value should be 1.</description>
                            <lsb>21</lsb>
                            <msb>21</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>This bit is read as 1. The write value should be 1.</description>
                            <lsb>22</lsb>
                            <msb>22</msb>
                            <access>read-write</access>
                        </field>
                        <field>
