ra-rs/ra/svd/vendor/R7FA8M1AH.svd
            </registers>
        </peripheral>
        <peripheral>
            <name>IWDT</name>
            <description>Independent Watchdog Timer</description>
            <baseAddress>0x40202200</baseAddress>
            <addressBlock>
                <offset>0x00</offset>
                <size>1</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x02</offset>
                <size>5</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x08</offset>
                <size>1</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x0A</offset>
                <size>3</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <name>IWDTRR</name>
                    <description>IWDT Refresh Register</description>
                    <addressOffset>0x00</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0xFF</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>IWDTRR</name>
                            <description>The down-counter is refreshed by writing 00h and then writing FFh to this register.</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>IWDTCR</name>
                    <description>IWDT Control Register</description>
                    <addressOffset>0x02</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x33F3</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>TOPS</name>
                            <description>Timeout Period Select</description>
                            <lsb>0</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>00</name>
                                    <description>1024 cycles (03FFh)</description>
                                    <value>#00</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>01</name>
                                    <description>4096 cycles (0FFFh)</description>
                                    <value>#01</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>10</name>
                                    <description>8192 cycles (1FFFh)</description>
                                    <value>#10</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>11</name>
                                    <description>16384 cycles (3FFFh).</description>
                                    <value>#11</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>00</name>
                                    <description>128 cycles (007Fh)</description>
                                    <value>#00</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>01</name>
                                    <description>512 cycles (01FFh)</description>
                                    <value>#01</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>10</name>
                                    <description>1024 cycles (03FFh)</description>
                                    <value>#10</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>11</name>
                                    <description>2048 cycles (07FFh).</description>
                                    <value>#11</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>These bits are read as 00. The write value should be 00.</description>
                            <lsb>2</lsb>
                            <msb>3</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CKS</name>
                            <description>Clock Division Ratio Select</description>
                            <lsb>4</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0000</name>
                                    <description>OCOCLK</description>
                                    <value>#0000</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0010</name>
                                    <description>OCOCLK/16</description>
                                    <value>#0010</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0011</name>
                                    <description>OCOCLK/32</description>
                                    <value>#0011</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0100</name>
                                    <description>OCOCLK/64</description>
                                    <value>#0100</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0111</name>
                                    <description>OCOCLK/128</description>
                                    <value>#0111</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0101</name>
                                    <description>OCOCLK/256</description>
                                    <value>#0101</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>RPES</name>
                            <description>Window End Position Select</description>
                            <lsb>8</lsb>
                            <msb>9</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>00</name>
                                    <description>75%</description>
                                    <value>#00</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>01</name>
                                    <description>50%</description>
                                    <value>#01</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>10</name>
                                    <description>25%</description>
                                    <value>#10</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>11</name>
                                    <description>0% (do not specify window end position).</description>
                                    <value>#11</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>These bits are read as 00. The write value should be 00.</description>
                            <lsb>10</lsb>
                            <msb>11</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RPSS</name>
                            <description>Window Start Position Select</description>
                            <lsb>12</lsb>
                            <msb>13</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>00</name>
                                    <description>25%</description>
                                    <value>#00</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>01</name>
                                    <description>50%</description>
                                    <value>#01</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>10</name>
                                    <description>75%</description>
                                    <value>#10</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>11</name>
                                    <description>100% (do not specify window start position).</description>
                                    <value>#11</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>These bits are read as 00. The write value should be 00.</description>
                            <lsb>14</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>IWDTRCR</name>
                    <description>IWDT Reset Control Register</description>
                    <addressOffset>0x06</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x80</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>Reserved</name>
                            <description>These bits are read as 0000000. The write value should be 0000000.</description>
                            <lsb>0</lsb>
                            <msb>6</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RSTIRQS</name>
                            <description>Reset Interrupt Request Select</description>
                            <lsb>7</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Non-maskable interrupt request or interrupt request output</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Reset output is enabled.</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>IWDTCSTPR</name>
                    <description>IWDT Count Stop Control Register</description>
                    <addressOffset>0x08</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0xC0</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>Reserved</name>
                            <description>These bits are read as 000000. The write value should be 000000.</description>
                            <lsb>0</lsb>
                            <msb>5</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CPU0SEL</name>
                            <description>Counter Interlocking CPU Select</description>
                            <lsb>6</lsb>
                            <msb>6</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Select CPU # 1 as the CPU interlocked with the counter</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Select CPU # 0 as the CPU interlocked with the counter</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>SLCSTP</name>
                            <description>Sleep-Mode Count Stop Control</description>
                            <lsb>7</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Count stop is disabled</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Count is stopped when transition to Sleep mode</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
