ra-rs/ra/svd/vendor/R7FA8M1AH.svd
                <register>
                    <name>PSARE</name>
                    <description>Peripheral Security Attribution Register E</description>
                    <addressOffset>0x010</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>Reserved</name>
                            <description>This bit is read as 0. The write value should be 0.</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PSARE1</name>
                            <description>WDT0 Security Attribution</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Secure</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>NonSecure</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>PSARE2</name>
                            <description>Independent Watchdog Timer Security Attribution</description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PSARE3</name>
                            <description>Real Time Clock  Security Attribution</description>
                            <lsb>3</lsb>
                            <msb>3</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>These bits are read as 0000. The write value should be 0000.</description>
                            <lsb>4</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PSARE8</name>
                            <description>ULPT1 Security Attribution</description>
                            <lsb>8</lsb>
                            <msb>8</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PSARE9</name>
                            <description>ULPT0 Security Attribution</description>
                            <lsb>9</lsb>
                            <msb>9</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>These bits are read as 00000. The write value should be 00000.</description>
                            <lsb>10</lsb>
                            <msb>14</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>This bit is read as 0. The write value should be 0.</description>
                            <lsb>15</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>These bits are read as 00. The write value should be 00.</description>
                            <lsb>16</lsb>
                            <msb>17</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PSARE18</name>
                            <description>General PWM Timer channel13 Security Attribution</description>
                            <lsb>18</lsb>
                            <msb>18</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PSARE19</name>
                            <description>General PWM Timer channel12 Security Attribution</description>
                            <lsb>19</lsb>
                            <msb>19</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PSARE20</name>
                            <description>General PWM Timer channel11 Security Attribution</description>
                            <lsb>20</lsb>
                            <msb>20</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PSARE21</name>
                            <description>General PWM Timer channel10 Security Attribution</description>
                            <lsb>21</lsb>
                            <msb>21</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PSARE22</name>
                            <description>General PWM Timer channel9 Security Attribution</description>
                            <lsb>22</lsb>
                            <msb>22</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PSARE23</name>
                            <description>General PWM Timer channel8 Security Attribution</description>
                            <lsb>23</lsb>
                            <msb>23</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PSARE24</name>
                            <description>General PWM Timer channel7 Security Attribution</description>
                            <lsb>24</lsb>
                            <msb>24</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PSARE25</name>
                            <description>General PWM Timer channel6 Security Attribution</description>
                            <lsb>25</lsb>
                            <msb>25</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PSARE26</name>
                            <description>General PWM Timer channel5 Security Attribution</description>
                            <lsb>26</lsb>
                            <msb>26</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PSARE27</name>
                            <description>General PWM Timer channel4 Security Attribution</description>
                            <lsb>27</lsb>
                            <msb>27</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PSARE28</name>
                            <description>General PWM Timer channel3 Security Attribution</description>
                            <lsb>28</lsb>
                            <msb>28</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PSARE29</name>
                            <description>General PWM Timer channel2 Security Attribution</description>
                            <lsb>29</lsb>
                            <msb>29</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PSARE30</name>
                            <description>General PWM Timer channel1 Security Attribution</description>
                            <lsb>30</lsb>
                            <msb>30</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PSARE31</name>
                            <description>General PWM Timer channel0 Security Attribution</description>
                            <lsb>31</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>MSSAR</name>
                    <description>Module Stop Security Attribution Register</description>
                    <addressOffset>0x014</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>MSSAR0</name>
                            <description>SRAM0 Clock Stop Security Attribution</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Secure.</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Non-Secure</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>MSSAR1</name>
                            <description>SRAM1 Clock Stop Security Attribution</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Secure.</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Non-Secure</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>These bits are read as 000000000. The write value should be 000000000.</description>
                            <lsb>2</lsb>
                            <msb>10</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>MSSAR11</name>
                            <description>CTCM0 Security Attribution</description>
                            <lsb>11</lsb>
                            <msb>11</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Secure.</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Non-Secure</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>This bit is read as 0. The write value should be 0.</description>
                            <lsb>12</lsb>
                            <msb>12</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>MSSAR13</name>
                            <description>STCM0 Security Attribution</description>
                            <lsb>13</lsb>
                            <msb>13</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Secure.</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Non-Secure</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>This bit is read as 0. The write value should be 0.</description>
                            <lsb>14</lsb>
                            <msb>14</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>MSSAR15</name>
                            <description>Standby RAM Clock Stop Security Attribution</description>
                            <lsb>15</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Secure.</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Non-Secure</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>These bits are read as 000000. The write value should be 000000.</description>
                            <lsb>16</lsb>
                            <msb>21</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>MSSAR22</name>
                            <description>DMAC0/DTC0 Clock Stop Security Attribution</description>
                            <lsb>22</lsb>
                            <msb>22</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>These bits are read as 00000000. The write value should be 00000000.</description>
                            <lsb>23</lsb>
                            <msb>30</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>MSSAR31</name>
                            <description>ELC clock stop Security Attribution</description>
                            <lsb>31</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Secure.</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Non-Secure</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
