ra-rs/ra/svd/vendor/R7FA8M1AH.svd
                <register>
                    <name>PPARE</name>
                    <description>Peripheral Privilege Attribution Register E</description>
                    <addressOffset>0x028</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0xFFFFFFFF</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>Reserved</name>
                            <description>This bit is read as 1. The write value should be 1.</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PPARE1</name>
                            <description>Watchdog Timer0 Privilege Attribution</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PPARE2</name>
                            <description>Independent Watchdog Timer Privilege Attribution</description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PPARE3</name>
                            <description>Real Time Clock  Privilege Attribution</description>
                            <lsb>3</lsb>
                            <msb>3</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>These bits are read as 1111. The write value should be 1111.</description>
                            <lsb>4</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PPARE8</name>
                            <description>ULPT1 Privilege Attribution</description>
                            <lsb>8</lsb>
                            <msb>8</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PPARE9</name>
                            <description>ULPT0 Privilege Attribution</description>
                            <lsb>9</lsb>
                            <msb>9</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>These bits are read as 11111. The write value should be 11111.</description>
                            <lsb>10</lsb>
                            <msb>14</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>This bit is read as 1. The write value should be 1.</description>
                            <lsb>15</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>These bits are read as 11. The write value should be 11.</description>
                            <lsb>16</lsb>
                            <msb>17</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PPARE18</name>
                            <description>General PWM Timer channel13 Privilege Attribution</description>
                            <lsb>18</lsb>
                            <msb>18</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PPARE19</name>
                            <description>General PWM Timer channel12 Privilege Attribution</description>
                            <lsb>19</lsb>
                            <msb>19</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PPARE20</name>
                            <description>General PWM Timer channel11 Privilege Attribution</description>
                            <lsb>20</lsb>
                            <msb>20</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PPARE21</name>
                            <description>General PWM Timer channel10 Privilege Attribution</description>
                            <lsb>21</lsb>
                            <msb>21</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PPARE22</name>
                            <description>General PWM Timer channel9 Privilege Attribution</description>
                            <lsb>22</lsb>
                            <msb>22</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PPARE23</name>
                            <description>General PWM Timer channel8 Privilege Attribution</description>
                            <lsb>23</lsb>
                            <msb>23</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PPARE24</name>
                            <description>General PWM Timer channel7 Privilege Attribution</description>
                            <lsb>24</lsb>
                            <msb>24</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PPARE25</name>
                            <description>General PWM Timer channel6 Privilege Attribution</description>
                            <lsb>25</lsb>
                            <msb>25</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PPARE26</name>
                            <description>General PWM Timer channel5 Privilege Attribution</description>
                            <lsb>26</lsb>
                            <msb>26</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PPARE27</name>
                            <description>General PWM Timer channel4 Privilege Attribution</description>
                            <lsb>27</lsb>
                            <msb>27</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PPARE28</name>
                            <description>General PWM Timer channel3 Privilege Attribution</description>
                            <lsb>28</lsb>
                            <msb>28</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PPARE29</name>
                            <description>General PWM Timer channel2 Privilege Attribution</description>
                            <lsb>29</lsb>
                            <msb>29</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PPARE30</name>
                            <description>General PWM Timer channel1 Privilege Attribution</description>
                            <lsb>30</lsb>
                            <msb>30</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PPARE31</name>
                            <description>General PWM Timer channel0 Privilege Attribution</description>
                            <lsb>31</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>MSPAR</name>
                    <description>Module Stop Privilege Attribution Register</description>
                    <addressOffset>0x02C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0xFFFFFFFF</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>Reserved</name>
                            <description>These bits are read as 1111111111111111. The write value should be 1111111111111111.</description>
                            <lsb>0</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>These bits are read as 111111111111111. The write value should be 111111111111111.</description>
                            <lsb>16</lsb>
                            <msb>30</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>MSPAR31</name>
                            <description>ELC clock stop Privilege Attribution</description>
                            <lsb>31</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Privilege.</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Non-Privilege</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CFSAMONA</name>
                    <description>Code Flash Security Attribution Monitor Register A</description>
                    <addressOffset>0x030</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFF007FFF</resetMask>
                    <fields>
                        <field>
                            <name>Reserved</name>
                            <description>These bits are read as 000000000000000.</description>
                            <lsb>0</lsb>
                            <msb>14</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>CFS2</name>
                            <description>Code Flash Secure area</description>
                            <lsb>15</lsb>
                            <msb>23</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>These bits are read as 00000000.</description>
                            <lsb>24</lsb>
                            <msb>31</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DFSAMON</name>
                    <description>Data Flash Security Attribution Monitor Register</description>
                    <addressOffset>0x034</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFF03FF</resetMask>
                    <fields>
                        <field>
                            <name>Reserved</name>
                            <description>These bits are read as 0000000000.</description>
                            <lsb>0</lsb>
                            <msb>9</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>DFS</name>
                            <description>Data flash Secure area</description>
                            <lsb>10</lsb>
                            <msb>15</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>These bits are read as 0000000000000000.</description>
                            <lsb>16</lsb>
                            <msb>31</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DLMMON</name>
                    <description>Device Lifecycle Management State Monitor Register</description>
                    <addressOffset>0x038</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0xFFFFFFF0</resetValue>
                    <resetMask>0xFFFFFFF0</resetMask>
                    <fields>
                        <field>
                            <name>DLMMON</name>
                            <description>Device Lifecycle Management State Monitor</description>
                            <lsb>0</lsb>
                            <msb>3</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>These bits are read as 111111111111.</description>
                            <lsb>4</lsb>
                            <msb>15</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>These bits are read as 1111111111111111.</description>
                            <lsb>16</lsb>
                            <msb>31</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
