ra-rs/ra/svd/vendor/R7FA8M1AH.svd
                <register>
                    <name>SSIOFR</name>
                    <description>Audio Format Register</description>
                    <addressOffset>0x20</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>OMOD</name>
                            <description>Audio Format Select</description>
                            <lsb>0</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>00</name>
                                    <description>I2S format</description>
                                    <value>#00</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>01</name>
                                    <description>TDM format</description>
                                    <value>#01</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>10</name>
                                    <description>Monaural format</description>
                                    <value>#10</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>11</name>
                                    <description>Setting prohibited.</description>
                                    <value>#11</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>These bits are read as 000000. The write value should be 000000.</description>
                            <lsb>2</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>LRCONT</name>
                            <description>Whether to Enable LRCK/FS Continuation</description>
                            <lsb>8</lsb>
                            <msb>8</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Disables LRCK/FS continuation.</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Enables LRCK/FS continuation.</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>BCKASTP</name>
                            <description>Whether to Enable Stopping BCK Output When SSIE is in Idle Status</description>
                            <lsb>9</lsb>
                            <msb>9</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Always outputs BCK to the SSIBCK pin.</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Automatically controls output of BCK to the SSIBCK pin.</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>These bits are read as 000000. The write value should be 000000.</description>
                            <lsb>10</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>These bits are read as 0000000000000000. The write value should be 0000000000000000.</description>
                            <lsb>16</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SSISCR</name>
                    <description>Status Control Register</description>
                    <addressOffset>0x24</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>RDFS</name>
                            <description>RDF Setting Condition Select</description>
                            <lsb>0</lsb>
                            <msb>4</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>00000</name>
                                    <description>SSIFRDR has one stage or more data size</description>
                                    <value>#00000</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>00001</name>
                                    <description>SSIFRDR has two stages or more data size (snip)</description>
                                    <value>#00001</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>11110</name>
                                    <description>SSIFRDR has thirty-one stages or more data size</description>
                                    <value>#11110</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>11111</name>
                                    <description>SSIFRDR has thirty-two stages or more data size.</description>
                                    <value>#11111</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>These bits are read as 000. The write value should be 000.</description>
                            <lsb>5</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TDES</name>
                            <description>TDE Setting Condition Select</description>
                            <lsb>8</lsb>
                            <msb>12</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>00000</name>
                                    <description>SSIFTDR has one stage or more free space</description>
                                    <value>#00000</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>00001</name>
                                    <description>SSIFTDR has two stages or more free space (snip)</description>
                                    <value>#00001</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>11110</name>
                                    <description>SSIFTDR has thirty-one stages or more free space</description>
                                    <value>#11110</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>11111</name>
                                    <description>SSIFTDR has thirty-two stages or more free space.</description>
                                    <value>#11111</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>These bits are read as 000. The write value should be 000.</description>
                            <lsb>13</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>These bits are read as 0000000000000000. The write value should be 0000000000000000.</description>
                            <lsb>16</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
