ra-rs/ra/svd/vendor/R7FA8M1AH.svd
                <register>
                    <dim>2</dim>
                    <dimIncrement>0x4</dimIncrement>
                    <dimIndex>0-1</dimIndex>
                    <name>LIOCFGCS%s</name>
                    <description>xSPI Link I/O Configuration register cs%s</description>
                    <addressOffset>0x050</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00070000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>PRTMD</name>
                            <description>Protocol mode</description>
                            <lsb>0</lsb>
                            <msb>9</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0_000_000_000b</name>
                                    <description>1S-1S-1S</description>
                                    <value>0x000</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1_110_110_010b</name>
                                    <description>4S-4D-4D</description>
                                    <value>0x3B2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1_111_111_111b</name>
                                    <description>8D-8D-8D</description>
                                    <value>0x3FF</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1_011_111_111b</name>
                                    <description>8D-8D-8S</description>
                                    <value>0x2FF</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0_001_001_000b</name>
                                    <description>1S-2S-2S</description>
                                    <value>0x048</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0_001_001_001b</name>
                                    <description>2S-2S-2S</description>
                                    <value>0x049</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0_010_010_000b</name>
                                    <description>1S-4S-4S</description>
                                    <value>0x090</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0_010_010_010b</name>
                                    <description>4S-4S-4S</description>
                                    <value>0x092</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>others</name>
                                    <description>Reserved</description>
                                    <isDefault>true</isDefault>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>LATEMD</name>
                            <description>Latency mode</description>
                            <lsb>10</lsb>
                            <msb>10</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Configurable latency</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Variable latency</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>WRMSKMD</name>
                            <description>Write mask mode</description>
                            <lsb>11</lsb>
                            <msb>11</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Write mask disable</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Write mask enable</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>These bits are read as 000. The write value should be 000.</description>
                            <lsb>12</lsb>
                            <msb>14</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>This bit is read as 0. The write value should be 0.</description>
                            <lsb>15</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CSMIN</name>
                            <description>CS minimum idle term</description>
                            <lsb>16</lsb>
                            <msb>19</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>1 cycle</description>
                                    <value>#0</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>CSASTEX</name>
                            <description>CS asserting extension</description>
                            <lsb>20</lsb>
                            <msb>20</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>No extension</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Extend 1 cycle</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>CSNEGEX</name>
                            <description>CS negating extension</description>
                            <lsb>21</lsb>
                            <msb>21</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>No extension</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Extend 1 cycle</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>SDRDRV</name>
                            <description>SDR driving timing</description>
                            <lsb>22</lsb>
                            <msb>22</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Drive at 1/2 cycle before CK rising-edge</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Drive at CK rising-edge</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>SDRSMPMD</name>
                            <description>SDR Sampling mode</description>
                            <lsb>23</lsb>
                            <msb>23</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Samples data input at falling-edge</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Samples data input at rising-edge</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>SDRSMPSFT</name>
                            <description>SDR Sampling window shift</description>
                            <lsb>24</lsb>
                            <msb>27</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Sample w/o delay</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Sample at 1 cycle delay</description>
                                    <value>#1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>others</name>
                                    <description>Reserved</description>
                                    <isDefault>true</isDefault>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>DDRSMPEX</name>
                            <description>DDR sampling window extend</description>
                            <lsb>28</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Expand no cycle</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Expand 1 cycle</description>
                                    <value>#1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>others</name>
                                    <description>Reserved</description>
                                    <isDefault>true</isDefault>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ABMCFG</name>
                    <description>xSPI AXI Bridge Map Config</description>
                    <addressOffset>0x058</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>ODRMD</name>
                            <description>AXI Transfer Ordering Mode</description>
                            <lsb>0</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>These bits are read as 00000000000000. The write value should be 00000000000000.</description>
                            <lsb>2</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CHSEL</name>
                            <description>AXI ID to Bridge Channel Select</description>
                            <lsb>16</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>BMCTL0</name>
                    <description>xSPI Bridge Map Control register 0</description>
                    <addressOffset>0x060</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x000000FF</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>CH0CS0ACC</name>
                            <description>System bus ch0 to slave0 memory area access enable</description>
                            <lsb>0</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CH0CS1ACC</name>
                            <description>System bus ch0 to slave1 memory area access enable</description>
                            <lsb>2</lsb>
                            <msb>3</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CH1CS0ACC</name>
                            <description>System bus ch1 to slave0 memory area access enable</description>
                            <lsb>4</lsb>
                            <msb>5</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CH1CS1ACC</name>
                            <description>System bus ch1 to slave1 memory area access enable</description>
                            <lsb>6</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>These bits are read as 00000000. The write value should be 00000000.</description>
                            <lsb>8</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>These bits are read as 0000000000000000. The write value should be 0000000000000000.</description>
                            <lsb>16</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>BMCTL1</name>
                    <description>xSPI Bridge Map Control register 1</description>
                    <addressOffset>0x064</addressOffset>
                    <size>32</size>
                    <access>write-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>Reserved</name>
                            <description>The write value should be 00000000.</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>MWRPUSHCH0</name>
                            <description>Memory Write Data Push for ch0</description>
                            <lsb>8</lsb>
                            <msb>8</msb>
                            <access>write-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>No command</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Push request</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>MWRPUSHCH1</name>
                            <description>Memory Write Data Push for ch1</description>
                            <lsb>9</lsb>
                            <msb>9</msb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>PBUFCLRCH0</name>
                            <description>Prefetch Buffer clear for ch0</description>
                            <lsb>10</lsb>
                            <msb>10</msb>
                            <access>write-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>No command</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Clear request</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>PBUFCLRCH1</name>
                            <description>Prefetch Buffer clear for ch1</description>
                            <lsb>11</lsb>
                            <msb>11</msb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>The write value should be 0000.</description>
                            <lsb>12</lsb>
                            <msb>15</msb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>The write value should be 0000000000000000.</description>
                            <lsb>16</lsb>
                            <msb>31</msb>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
