ra-rs/ra/svd/vendor/R7FA8M1AH.svd
                <register>
                    <name>GTST</name>
                    <description>General PWM Timer Status Register</description>
                    <addressOffset>0x3C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00008000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>TCFA</name>
                            <description>Input Capture/Compare Match Flag A</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>No input capture/compare match of GTCCRA is generated.</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>An input capture/compare match of GTCCRA is generated.</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>TCFB</name>
                            <description>Input Capture/Compare Match Flag B</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>No input capture/compare match of GTCCRB is generated.</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>An input capture/compare match of GTCCRB is generated.</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>TCFC</name>
                            <description>Input Compare Match Flag C</description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>No compare match of GTCCRC is generated.</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>A compare match of GTCCRC is generated.</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>TCFD</name>
                            <description>Input Compare Match Flag D</description>
                            <lsb>3</lsb>
                            <msb>3</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>No compare match of GTCCRD is generated.</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>A compare match of GTCCRD is generated.</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>TCFE</name>
                            <description>Input Compare Match Flag E</description>
                            <lsb>4</lsb>
                            <msb>4</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>No compare match of GTCCRE is generated.</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>A compare match of GTCCRE is generated.</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>TCFF</name>
                            <description>Input Compare Match Flag F</description>
                            <lsb>5</lsb>
                            <msb>5</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>No compare match of GTCCRF is generated.</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>A compare match of GTCCRF is generated.</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>TCFPO</name>
                            <description>Overflow Flag</description>
                            <lsb>6</lsb>
                            <msb>6</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>No overflow (crest) has occurred.</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>An overflow (crest) has occurred.</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>TCFPU</name>
                            <description>Underflow Flag</description>
                            <lsb>7</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>No underflow (trough) has occurred.</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>An underflow (trough) has occurred.</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>These bits are read as 000. The write value should be 000.</description>
                            <lsb>8</lsb>
                            <msb>10</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>These bits are read as 0000. The write value should be 0000.</description>
                            <lsb>11</lsb>
                            <msb>14</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TUCF</name>
                            <description>Count Direction Flag</description>
                            <lsb>15</lsb>
                            <msb>15</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>GTCNT counter is counting down</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>GTCNT counter is counting up.</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>ADTRAUF</name>
                            <description>GTADTRA Register Compare Match(Up-Counting) A/D Converter Start Request Flag</description>
                            <lsb>16</lsb>
                            <msb>16</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>No GTADTRA register compare match has occurred in up-counting.</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>A GTADTRA register compare match has occurred in up-counting.</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>ADTRADF</name>
                            <description>GTADTRA Register Compare Match(Down-Counting) A/D Converter Start Request Flag</description>
                            <lsb>17</lsb>
                            <msb>17</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>No GTADTRA register compare match has occurred in down-counting.</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>A GTADTRA register compare match has occurred in down-counting.</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>ADTRBUF</name>
                            <description>GTADTRB Register Compare Match(Up-Counting) A/D Converter Start Request Flag</description>
                            <lsb>18</lsb>
                            <msb>18</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>No GTADTRB register compare match has occurred in up-counting.</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>A GTADTRB register compare match has occurred in up-counting.</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>ADTRBDF</name>
                            <description>GTADTRB Register Compare Match(Down-Counting) A/D Converter Start Request Flag</description>
                            <lsb>19</lsb>
                            <msb>19</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>No GTADTRB register compare match has occurred in down-counting.</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>A GTADTRB register compare match has occurred in down-counting.</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>These bits are read as 0000. The write value should be 0000.</description>
                            <lsb>20</lsb>
                            <msb>23</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ODF</name>
                            <description>Output Disable Flag</description>
                            <lsb>24</lsb>
                            <msb>24</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>No output disable request is generated.</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>An output disable request is generated.</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>These bits are read as 000. The write value should be 000.</description>
                            <lsb>25</lsb>
                            <msb>27</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>This bit is read as 0. The write value should be 0.</description>
                            <lsb>28</lsb>
                            <msb>28</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>OABHF</name>
                            <description>Same Time Output Level High Disable Request Enable</description>
                            <lsb>29</lsb>
                            <msb>29</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>GTIOCA pin and GTIOCB pin don't output 1 at the same time.</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>GTIOCA pin and GTIOCB pin output 1 at the same time.</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>OABLF</name>
                            <description>Same Time Output Level Low Disable Request Enable</description>
                            <lsb>30</lsb>
                            <msb>30</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>GTIOCA pin and GTIOCB pin don't output 0 at the same time.</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>GTIOCA pin and GTIOCB pin output 0 at the same time.</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>PCF</name>
                            <description>Period Count Function Finish Flag</description>
                            <lsb>31</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>No period count function finish has occurred.</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>A period count function finish has occurred.</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
