ra-rs/ra/svd/vendor/R7FA8M1AH.svd
                <register>
                    <name>GTICLF</name>
                    <description>General PWM Timer Inter Channel Logical Operation Function Setting Register</description>
                    <addressOffset>0xB8</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>ICLFA</name>
                            <description>GTIOCnA Output Logical Operation Function Select</description>
                            <lsb>0</lsb>
                            <msb>2</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>000</name>
                                    <description>A (no delay)</description>
                                    <value>#000</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>001</name>
                                    <description>NOT A (no delay)</description>
                                    <value>#001</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>010</name>
                                    <description>C (1PCLKGPTn delay)</description>
                                    <value>#010</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>011</name>
                                    <description>NOT C (1PCLKGPTn delay)</description>
                                    <value>#011</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>100</name>
                                    <description>A AND C (1PCLKGPTndelay) </description>
                                    <value>#100</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>101</name>
                                    <description>A OR C (1PCLKGPTndelay) </description>
                                    <value>#101</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>110</name>
                                    <description>A EXOR C (1PCLKGPTn delay) </description>
                                    <value>#110</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>111</name>
                                    <description>A NOR C (1PCLKGPTndelay) </description>
                                    <value>#111</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>This bit is read as 0. The write value should be 0.</description>
                            <lsb>3</lsb>
                            <msb>3</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ICLFSELC</name>
                            <description>Inter Channel Signal C Select</description>
                            <lsb>4</lsb>
                            <msb>9</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>000000</name>
                                    <description>GTIOC0A</description>
                                    <value>#000000</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>000001</name>
                                    <description>GTIOC0B</description>
                                    <value>#000001</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>000010</name>
                                    <description>GTIOC1A</description>
                                    <value>#000010</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>000011</name>
                                    <description>GTIOC1B</description>
                                    <value>#000011</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>000100</name>
                                    <description>GTIOC2A</description>
                                    <value>#000100</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>000101</name>
                                    <description>GTIOC2B</description>
                                    <value>#000101</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>000110</name>
                                    <description>GTIOC3A</description>
                                    <value>#000110</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>000111</name>
                                    <description>GTIOC3B</description>
                                    <value>#000111</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>111110</name>
                                    <description>GTIOC31A</description>
                                    <value>#111110</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>111111</name>
                                    <description>GTIOC31B</description>
                                    <value>#111111</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>These bits are read as 000000. The write value should be 000000.</description>
                            <lsb>10</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ICLFB</name>
                            <description>GTIOCnB Output Logical Operation Function Select</description>
                            <lsb>16</lsb>
                            <msb>18</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>000</name>
                                    <description>B (no delay)</description>
                                    <value>#000</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>001</name>
                                    <description>NOT B (no delay)</description>
                                    <value>#001</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>010</name>
                                    <description>D (1PCLKGPTn delay)</description>
                                    <value>#010</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>011</name>
                                    <description>NOT D (1PCLKGPTn delay)</description>
                                    <value>#011</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>100</name>
                                    <description>B AND D (1PCLKGPTn delay)</description>
                                    <value>#100</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>101</name>
                                    <description>B OR D (1PCLKGPTn delay)</description>
                                    <value>#101</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>110</name>
                                    <description>B EXOR D (1PCLKGPTn delay) </description>
                                    <value>#110</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>111</name>
                                    <description>B NOR D (1PCLKGPTn delay)</description>
                                    <value>#111</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>This bit is read as 0. The write value should be 0.</description>
                            <lsb>19</lsb>
                            <msb>19</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ICLFSELD</name>
                            <description>Inter Channel Signal D Select</description>
                            <lsb>20</lsb>
                            <msb>25</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>000000</name>
                                    <description>GTIOC0A</description>
                                    <value>#000000</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>000001</name>
                                    <description>GTIOC0B</description>
                                    <value>#000001</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>000010</name>
                                    <description>GTIOC1A</description>
                                    <value>#000010</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>000011</name>
                                    <description>GTIOC1B</description>
                                    <value>#000011</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>000100</name>
                                    <description>GTIOC2A</description>
                                    <value>#000100</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>000101</name>
                                    <description>GTIOC2B</description>
                                    <value>#000101</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>000110</name>
                                    <description>GTIOC3A</description>
                                    <value>#000110</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>000111</name>
                                    <description>GTIOC3B</description>
                                    <value>#000111</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>111110</name>
                                    <description>GTIOC31A</description>
                                    <value>#111110</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>111111</name>
                                    <description>GTIOC31B</description>
                                    <value>#111111</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>These bits are read as 000000. The write value should be 000000.</description>
                            <lsb>26</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GTPC</name>
                    <description>General PWM Timer Period Count Register</description>
                    <addressOffset>0xBC</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>PCEN</name>
                            <description>Period Count Function Enable</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Period count function is disabled.</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Period count function is enabled.</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>ASTP</name>
                            <description>Automatic Stop Function Enable</description>
                            <lsb>8</lsb>
                            <msb>8</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Automatic stop function is disabled.</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Automatic stop function is enabled.</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>These bits are read as 0000000. The write value should be 0000000.</description>
                            <lsb>9</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PCNT</name>
                            <description>Period Counter</description>
                            <lsb>16</lsb>
                            <msb>27</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>These bits are read as 0000. The write value should be 0000.</description>
                            <lsb>28</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
