ra-rs/ra/svd/vendor/R7FA8M1AH.svd
                <register>
                    <name>BG_VSIZE</name>
                    <description>Background Plane Setting Full Image Vertical Size Register</description>
                    <addressOffset>0x100C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00070010</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>VW</name>
                            <description>Background plane vertical valid pixel width on the basis of line </description>
                            <lsb>0</lsb>
                            <msb>10</msb>
                            <access>read-write</access>
                            <writeConstraint>
                                <range>
                                    <minimum>0x0010</minimum>
                                    <maximum>0x03FC</maximum>
                                </range>
                            </writeConstraint>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>VW</name>
                                    <description>VW lines. The valid range is 0x010 to 0x3F0. </description>
                                    <isDefault>true</isDefault>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>These bits are read as 00000. The write value should be 00000.</description>
                            <lsb>11</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>VP</name>
                            <description>Background plane vertical valid pixel start position on the basis of line</description>
                            <lsb>16</lsb>
                            <msb>26</msb>
                            <access>read-write</access>
                            <writeConstraint>
                                <range>
                                    <minimum>0x0003</minimum>
                                    <maximum>0x3EF</maximum>
                                </range>
                            </writeConstraint>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>VP</name>
                                    <description>VP lines. The valid range is 0x003 to 0x3EF. </description>
                                    <isDefault>true</isDefault>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>These bits are read as 00000. The write value should be 00000.</description>
                            <lsb>27</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>BG_HSIZE</name>
                    <description>Background Plane Setting Full Image Horizontal Size Register</description>
                    <addressOffset>0x1010</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00060010</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>HW</name>
                            <description>Background plane horizontall valid pixel width on the basis of pixel clock (PXCLK)Note: When serial RGB is selected as the output format for the output control block, add two to the horizontal enable signal width and set the resulting value to this field. </description>
                            <lsb>0</lsb>
                            <msb>10</msb>
                            <access>read-write</access>
                            <writeConstraint>
                                <range>
                                    <minimum>0x010</minimum>
                                    <maximum>0x3F8</maximum>
                                </range>
                            </writeConstraint>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>HW</name>
                                    <description>HW cycles. The valid range is 0x010 to 0x3F8. </description>
                                    <isDefault>true</isDefault>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>These bits are read as 00000. The write value should be 00000.</description>
                            <lsb>11</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>HP</name>
                            <description>Background plane horizontal valid pixel start position on the basis of pixel clock (PXCLK).</description>
                            <lsb>16</lsb>
                            <msb>26</msb>
                            <access>read-write</access>
                            <writeConstraint>
                                <range>
                                    <minimum>0x006</minimum>
                                    <maximum>0x3EE</maximum>
                                </range>
                            </writeConstraint>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>HP</name>
                                    <description>HP cycle(pixel). The valid range is 0x006 to 0x3EE. </description>
                                    <isDefault>true</isDefault>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>These bits are read as 00000. The write value should be 00000.</description>
                            <lsb>27</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>BG_BGC</name>
                    <description>Background Plane Setting Background Color Register</description>
                    <addressOffset>0x1014</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>B</name>
                            <description>B value for background plane valid pixel areaUnsigned; 8-bit integer</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>G</name>
                            <description>G value for background plane valid pixel areaUnsigned; 8-bit integer</description>
                            <lsb>8</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>R</name>
                            <description>R value for background plane valid pixel area.Unsigned; 8-bit integer.</description>
                            <lsb>16</lsb>
                            <msb>23</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>These bits are read as 00000000. The write value should be 00000000.</description>
                            <lsb>24</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>BG_MON</name>
                    <description>Background Plane Setting Status Monitor Register</description>
                    <addressOffset>0x1018</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>EN</name>
                            <description>Background plane generation module operation state monitor.</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Operation is in progress.</description>
                                    <value>#1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Operation is stopped.</description>
                                    <value>#0</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>These bits are read as 0000000.</description>
                            <lsb>1</lsb>
                            <msb>7</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>VEN</name>
                            <description>Entire module internal operation reflection control signal monitor.The signal  state for controlling reflection of the register values to the internal operations upon assertion of the vertical synchronization signal.</description>
                            <lsb>8</lsb>
                            <msb>8</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>The signal for controlling reflection of the register values to the internal operations upon assertion of the vertical synchronization signal is asserted.</description>
                                    <value>#1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>The signal for controlling reflection of the register values to the internal operations upon assertion of the vertical synchronization signal is negated.</description>
                                    <value>#0</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>SWRST</name>
                            <description>Entire module SW reset state monitor.</description>
                            <lsb>16</lsb>
                            <msb>16</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>The entire module is released from the SW reset state.</description>
                                    <value>#1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>The entire module is in the SW reset state.</description>
                                    <value>#0</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>These bits are read as 000000000000000.</description>
                            <lsb>17</lsb>
                            <msb>31</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>2</dim>
                    <dimIncrement>0x100</dimIncrement>
                    <dimIndex>1,2</dimIndex>
                    <name>GR%s_VEN</name>
                    <description>Graphics %s  Register Update Control Register</description>
                    <addressOffset>0x1100</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>PVEN</name>
                            <description>Control of graphics n module register value reflection to internal operations.Reflection of the register values to the internal operation at the assertion of the vertical synchronization signal (VS).</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                            <modifiedWriteValues>zeroToClear</modifiedWriteValues>
                            <readAction>modify</readAction>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Enables reflection of the register values to the internal operation at the assertion of the vertical synchronization signal (VS).</description>
                                    <value>#1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Disables reflection of the register values to the internal operation at the assertion of the vertical synchronization signal (VS).</description>
                                    <value>#0</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>These bits are read as 0000000000000000000000000000000. The write value should be 0000000000000000000000000000000.</description>
                            <lsb>1</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>2</dim>
                    <dimIncrement>0x100</dimIncrement>
                    <dimIndex>1,2</dimIndex>
                    <name>GR%s_FLMRD</name>
                    <description>Graphics %s Frame Buffer Read Control Register</description>
                    <addressOffset>0x1104</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>RENB</name>
                            <description>Graphics data (frame buffer data) read enable.</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Enables reading.</description>
                                    <value>#1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Disables reading.</description>
                                    <value>#0</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>These bits are read as 000000000000000. The write value should be 000000000000000.</description>
                            <lsb>1</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>These bits are read as 0000000000000000. The write value should be 0000000000000000.</description>
                            <lsb>16</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>2</dim>
                    <dimIncrement>0x100</dimIncrement>
                    <dimIndex>1,2</dimIndex>
                    <name>GR%s_FLM1</name>
                    <description>Graphics %s Frame Buffer Control Register 1</description>
                    <addressOffset>0x1108</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000003</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>BSTMD</name>
                            <description>Burst transfer control for graphics data (frame buffer data)access</description>
                            <lsb>0</lsb>
                            <msb>1</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>11</name>
                                    <description>16-beat increment burst transfer (64-byte boundary)</description>
                                    <value>#11</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>others</name>
                                    <description>Setting prohibited.</description>
                                    <isDefault>true</isDefault>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>These bits are read as 000000000000000000000000000000. The write value should be 000000000000000000000000000000.</description>
                            <lsb>2</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>2</dim>
                    <dimIncrement>0x100</dimIncrement>
                    <dimIndex>1,2</dimIndex>
                    <name>GR%s_FLM2</name>
                    <description>Graphics %s Frame Buffer Control Register 2</description>
                    <addressOffset>0x110C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>BASE</name>
                            <description>Base address for accessing graphics data (frame buffer data)Set the head address in the frame buffer where graphics data is to be stored. GRn_FLM2.BASE[5:0] should be fixed to 0 during 64-byte burst transfer.</description>
                            <lsb>0</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>2</dim>
                    <dimIncrement>0x100</dimIncrement>
                    <dimIndex>1,2</dimIndex>
                    <name>GR%s_FLM3</name>
                    <description>Graphics %s Frame Buffer Control Register 3</description>
                    <addressOffset>0x1110</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>LNOFF</name>
                            <description>Macro line offset address for accessing graphics data(frame buffer data)Signed; 16-bit integer</description>
                            <lsb>16</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
