ra-rs/ra/svd/vendor/R7FA8M1AH.svd
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>RLE disabled</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>RLE enabled</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>CLUTENABLE</name>
                            <description>CLUT enable</description>
                            <lsb>25</lsb>
                            <msb>25</msb>
                            <access>write-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>CLUT disabled</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>CLUT enabled</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>COLKEYENABLE</name>
                            <description>color keying enable</description>
                            <lsb>26</lsb>
                            <msb>26</msb>
                            <access>write-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>color keying disabled</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>color keying enabled</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>CLUTFORMAT</name>
                            <description>Format of the CLUT</description>
                            <lsb>27</lsb>
                            <msb>27</msb>
                            <access>write-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>aRGB(8888)</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>RGB(565)</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>BSIA</name>
                            <description>Blend source factor inverted in alpha channel (USEACB = 1)</description>
                            <lsb>28</lsb>
                            <msb>28</msb>
                            <access>write-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>use blend factor as specified through BSFA</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>invert blend source factor (1-x)</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>BDIA</name>
                            <description>Blend destination factor inverted in alpha channel (USEACB = 1)</description>
                            <lsb>29</lsb>
                            <msb>29</msb>
                            <access>write-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>use blend factor as specified through BDFA</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>invert blend destination factor (1-x)</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>RLEPIXELWIDTH</name>
                            <description>Texel width for RLE unit</description>
                            <lsb>30</lsb>
                            <msb>31</msb>
                            <access>write-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>00</name>
                                    <description>1 byte per texel</description>
                                    <value>#00</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>01</name>
                                    <description>2 byte per texel</description>
                                    <value>#01</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>10</name>
                                    <description>3 byte per texel</description>
                                    <value>#10</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>11</name>
                                    <description>4 byte per texel</description>
                                    <value>#11</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>HWREVISION</name>
                    <description>Hardware Version and Feature Set ID Register</description>
                    <alternateRegister>CONTROL2</alternateRegister>
                    <addressOffset>0x04</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0FBE0107</resetValue>
                    <resetMask>0xFFFFF000</resetMask>
                    <fields>
                        <field>
                            <name>REV</name>
                            <description>Revision number</description>
                            <lsb>0</lsb>
                            <msb>11</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>These bits are read as 0000.</description>
                            <lsb>12</lsb>
                            <msb>15</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>This bit is read as 0.</description>
                            <lsb>16</lsb>
                            <msb>16</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>DLR</name>
                            <description>Display list reader feature</description>
                            <lsb>17</lsb>
                            <msb>17</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Display list reader unavailable</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Display list reader available</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>FBCACHE</name>
                            <description>Framebuffer cache feature</description>
                            <lsb>18</lsb>
                            <msb>18</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Framebuffer cache unavailable</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Framebuffer cache available</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>TXCACHE</name>
                            <description>Texture cache feature</description>
                            <lsb>19</lsb>
                            <msb>19</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Texture cache unavailable</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Texture cache available</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>PERFCOUNT</name>
                            <description>Two performance counter feature</description>
                            <lsb>20</lsb>
                            <msb>20</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Two performance counter unavailable</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Two performance counter available</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>TEXCLU</name>
                            <description>Texture CLUT with 16 or 256 entries feature </description>
                            <lsb>21</lsb>
                            <msb>21</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Texture CLUT with 16 or 256 entries unavailable</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Texture CLUT with 16 or 256 entries available</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>This bit is read as 0.</description>
                            <lsb>22</lsb>
                            <msb>22</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RLEUNIT</name>
                            <description>RLE unit feature </description>
                            <lsb>23</lsb>
                            <msb>23</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>RLE unit unavailable</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>RLE unit available</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>TEXCLUT256</name>
                            <description>Texture CLUT feature </description>
                            <lsb>24</lsb>
                            <msb>24</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Texture CLUT unavailable</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Texture CLUT available</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>COLORKEY</name>
                            <description>Colorkey feature </description>
                            <lsb>25</lsb>
                            <msb>25</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Colorkey unavailable</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Colorkey available</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>This bit is read as 1.</description>
                            <lsb>26</lsb>
                            <msb>26</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>ACBLEND</name>
                            <description>Alpha channel blending feature </description>
                            <lsb>27</lsb>
                            <msb>27</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Alpha channel blending unavailable</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Alpha channel blending available</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>These bits are read as 0000.</description>
                            <lsb>28</lsb>
                            <msb>31</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>6</dim>
                    <dimIncrement>0x4</dimIncrement>
                    <dimIndex>1-6</dimIndex>
                    <name>L%sSTART</name>
                    <description>Limiter %s Start Value Register</description>
                    <addressOffset>0x10</addressOffset>
                    <size>32</size>
                    <access>write-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>LSTART</name>
                            <description>Start value of the n'th limiter(n=1-6)</description>
                            <lsb>0</lsb>
                            <msb>31</msb>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>6</dim>
                    <dimIncrement>0x4</dimIncrement>
                    <dimIndex>1-6</dimIndex>
                    <name>L%sXADD</name>
                    <description>Limiter %s X-Axis Increment Register</description>
                    <addressOffset>0x28</addressOffset>
                    <size>32</size>
                    <access>write-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>LXADD</name>
                            <description>X-axis increment</description>
                            <lsb>0</lsb>
                            <msb>31</msb>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>6</dim>
                    <dimIncrement>0x4</dimIncrement>
                    <dimIndex>1-6</dimIndex>
                    <name>L%sYADD</name>
                    <description>Limiter %s Y-Axis Increment Register</description>
                    <addressOffset>0x40</addressOffset>
                    <size>32</size>
                    <access>write-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>LYADD</name>
                            <description>Y-axis increment</description>
                            <lsb>0</lsb>
                            <msb>31</msb>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>2</dim>
                    <dimIncrement>0x4</dimIncrement>
                    <dimIndex>1,2</dimIndex>
                    <name>L%sBAND</name>
                    <description>Limiter %s Band Width Parameter Register</description>
                    <addressOffset>0x58</addressOffset>
                    <size>32</size>
                    <access>write-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>LBAND</name>
                            <description>Limiter m band width parameter</description>
                            <lsb>0</lsb>
                            <msb>31</msb>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
