ra-rs/ra/svd/vendor/R7FA8M1AH.svd
                <register>
                    <name>HSCLKSETR</name>
                    <description>HS Clock Set Register</description>
                    <addressOffset>0x104</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>HSCLST</name>
                            <description>HS Clock Start</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Stop HS transmission (keep LP state)</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Start HS transmission</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>HSCLMD</name>
                            <description>HS Clock Running Mode</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Non-continuous clock mode</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Continuous clock mode</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>These bits are read as 000000000000000000000000000000. The write value should be 000000000000000000000000000000.</description>
                            <lsb>2</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>HSCLKSETR_L</name>
                    <description>HS Clock Set Register</description>
                    <alternateRegister>HSCLKSETR</alternateRegister>
                    <addressOffset>0x104</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>HSCLST</name>
                            <description>HS Clock Start</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Stop HS transmission (keep LP state)</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Start HS transmission</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>HSCLMD</name>
                            <description>HS Clock Running Mode</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Non-continuous clock mode</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Continuous clock mode</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>These bits are read as 00000000000000. The write value should be 00000000000000.</description>
                            <lsb>2</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>HSCLKSETR_LL</name>
                    <description>HS Clock Set Register</description>
                    <alternateRegister>HSCLKSETR</alternateRegister>
                    <addressOffset>0x104</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>HSCLST</name>
                            <description>HS Clock Start</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Stop HS transmission (keep LP state)</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Start HS transmission</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>HSCLMD</name>
                            <description>HS Clock Running Mode</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Non-continuous clock mode</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Continuous clock mode</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>These bits are read as 000000. The write value should be 000000.</description>
                            <lsb>2</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ULPSSETR</name>
                    <description>ULPS Set Register</description>
                    <addressOffset>0x108</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x000000A0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>WKUP</name>
                            <description>ULPS Wakeup Period</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>These bits are read as 000000000000000000000000. The write value should be 000000000000000000000000.</description>
                            <lsb>8</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ULPSSETR_L</name>
                    <description>ULPS Set Register</description>
                    <alternateRegister>ULPSSETR</alternateRegister>
                    <addressOffset>0x108</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x00A0</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>WKUP</name>
                            <description>ULPS Wakeup Period</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>These bits are read as 00000000. The write value should be 00000000.</description>
                            <lsb>8</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ULPSSETR_LL</name>
                    <description>ULPS Set Register</description>
                    <alternateRegister>ULPSSETR</alternateRegister>
                    <addressOffset>0x108</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0xA0</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>WKUP</name>
                            <description>ULPS Wakeup Period</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ULPSCR</name>
                    <description>ULPS Control Register</description>
                    <addressOffset>0x10C</addressOffset>
                    <size>32</size>
                    <access>write-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>Reserved</name>
                            <description>The write value should be 000000000000000000000000.</description>
                            <lsb>0</lsb>
                            <msb>23</msb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>CLENT</name>
                            <description>CL ULPS Enter</description>
                            <lsb>24</lsb>
                            <msb>24</msb>
                            <access>write-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>No operation</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Transition Clock Lane to ULPS</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>CLEXIT</name>
                            <description>CL ULPS Exit</description>
                            <lsb>25</lsb>
                            <msb>25</msb>
                            <access>write-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>No operation</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Clock Lane exits from ULPS</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>The write value should be 00.</description>
                            <lsb>26</lsb>
                            <msb>27</msb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>DLENT</name>
                            <description>DL ULPS Enter</description>
                            <lsb>28</lsb>
                            <msb>28</msb>
                            <access>write-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>No operation</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Transition Data Lanes to ULPS</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>DLEXIT</name>
                            <description>DL ULPS Exit</description>
                            <lsb>29</lsb>
                            <msb>29</msb>
                            <access>write-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>No operation</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Data Lanes exit from ULPS</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>The write value should be 00.</description>
                            <lsb>30</lsb>
                            <msb>31</msb>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ULPSCR_H</name>
                    <description>ULPS Control Register</description>
                    <alternateRegister>ULPSCR</alternateRegister>
                    <addressOffset>0x10E</addressOffset>
                    <size>16</size>
                    <access>write-only</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>Reserved</name>
                            <description>The write value should be 00000000.</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>CLENT</name>
                            <description>CL ULPS Enter</description>
                            <lsb>8</lsb>
                            <msb>8</msb>
                            <access>write-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>No operation</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Transition Clock Lane to ULPS</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>CLEXIT</name>
                            <description>CL ULPS Exit</description>
                            <lsb>9</lsb>
                            <msb>9</msb>
                            <access>write-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>No operation</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Clock Lane exits from ULPS</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>The write value should be 00.</description>
                            <lsb>10</lsb>
                            <msb>11</msb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>DLENT</name>
                            <description>DL ULPS Enter</description>
                            <lsb>12</lsb>
                            <msb>12</msb>
                            <access>write-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>No operation</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Transition Data Lanes to ULPS</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>DLEXIT</name>
                            <description>DL ULPS Exit</description>
                            <lsb>13</lsb>
                            <msb>13</msb>
                            <access>write-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>No operation</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Data Lanes exit from ULPS</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>The write value should be 00.</description>
                            <lsb>14</lsb>
                            <msb>15</msb>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
