ra-rs/ra/svd/vendor/R7FA8M1AH.svd
                <register>
                    <name>CLSTPTSETR_LL</name>
                    <description>Clock Lane Stop Time Set Register</description>
                    <alternateRegister>CLSTPTSETR</alternateRegister>
                    <addressOffset>0x314</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>Reserved</name>
                            <description>These bits are read as 00. The write value should be 00.</description>
                            <lsb>0</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CLKSTPT</name>
                            <description>Clock Stop Time</description>
                            <lsb>2</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CLSTPTSETR_LH</name>
                    <description>Clock Lane Stop Time Set Register</description>
                    <alternateRegister>CLSTPTSETR</alternateRegister>
                    <addressOffset>0x315</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>CLKSTPT</name>
                            <description>Clock Stop Time</description>
                            <lsb>0</lsb>
                            <msb>3</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>These bits are read as 0000. The write value should be 0000.</description>
                            <lsb>4</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CLSTPTSETR_H</name>
                    <description>Clock Lane Stop Time Set Register</description>
                    <alternateRegister>CLSTPTSETR</alternateRegister>
                    <addressOffset>0x316</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>CLKBFHT</name>
                            <description>Clock Beforehand Time</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CLKKPT</name>
                            <description>Clock Keep Time</description>
                            <lsb>8</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CLSTPTSETR_HL</name>
                    <description>Clock Lane Stop Time Set Register</description>
                    <alternateRegister>CLSTPTSETR</alternateRegister>
                    <addressOffset>0x316</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>CLKBFHT</name>
                            <description>Clock Beforehand Time</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CLSTPTSETR_HH</name>
                    <description>Clock Lane Stop Time Set Register</description>
                    <alternateRegister>CLSTPTSETR</alternateRegister>
                    <addressOffset>0x317</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>CLKKPT</name>
                            <description>Clock Keep Time</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>LPTRNSTSETR</name>
                    <description>LP Transition Time Set Register</description>
                    <addressOffset>0x318</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>GOLPBKT</name>
                            <description>Go LP and Back Time</description>
                            <lsb>0</lsb>
                            <msb>9</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>These bits are read as 0000000000000000000000. The write value should be 0000000000000000000000.</description>
                            <lsb>10</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>LPTRNSTSETR_L</name>
                    <description>LP Transition Time Set Register</description>
                    <alternateRegister>LPTRNSTSETR</alternateRegister>
                    <addressOffset>0x318</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>GOLPBKT</name>
                            <description>Go LP and Back Time</description>
                            <lsb>0</lsb>
                            <msb>9</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>These bits are read as 000000. The write value should be 000000.</description>
                            <lsb>10</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>LPTRNSTSETR_LL</name>
                    <description>LP Transition Time Set Register</description>
                    <alternateRegister>LPTRNSTSETR</alternateRegister>
                    <addressOffset>0x318</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>GOLPBKT</name>
                            <description>Go LP and Back Time</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>LPTRNSTSETR_LH</name>
                    <description>LP Transition Time Set Register</description>
                    <alternateRegister>LPTRNSTSETR</alternateRegister>
                    <addressOffset>0x319</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>GOLPBKT</name>
                            <description>Go LP and Back Time</description>
                            <lsb>0</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>These bits are read as 000000. The write value should be 000000.</description>
                            <lsb>2</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
