ra-rs/ra/svd/vendor/R7FA8M1AH.svd
                <register>
                    <name>SQCH0SET0R</name>
                    <description>Sequence Channel 0 Set 0 Register</description>
                    <addressOffset>0x5C0</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00800000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>START</name>
                            <description>Sequence Operation Start</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>write-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>No operation</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Start the sequence operation</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>This bit is read as 0. The write value should be 0.</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>These bits are read as 00. The write value should be 00.</description>
                            <lsb>2</lsb>
                            <msb>3</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>These bits are read as 0000. The write value should be 0000.</description>
                            <lsb>4</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>This bit is read as 0. The write value should be 0.</description>
                            <lsb>8</lsb>
                            <msb>8</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>These bits are read as 00000000000000. The write value should be 00000000000000.</description>
                            <lsb>9</lsb>
                            <msb>22</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>This bit is read as 1. The write value should be 1.</description>
                            <lsb>23</lsb>
                            <msb>23</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>These bits are read as 0000000. The write value should be 0000000.</description>
                            <lsb>24</lsb>
                            <msb>30</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>This bit is read as 0. The write value should be 0.</description>
                            <lsb>31</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SQCH0SET0R_L</name>
                    <description>Sequence Channel 0 Set 0 Register</description>
                    <alternateRegister>SQCH0SET0R</alternateRegister>
                    <addressOffset>0x5C0</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>START</name>
                            <description>Sequence Operation Start</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>write-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>No operation</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Start the sequence operation</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>This bit is read as 0. The write value should be 0.</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>These bits are read as 00. The write value should be 00.</description>
                            <lsb>2</lsb>
                            <msb>3</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>These bits are read as 0000. The write value should be 0000.</description>
                            <lsb>4</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>This bit is read as 0. The write value should be 0.</description>
                            <lsb>8</lsb>
                            <msb>8</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>These bits are read as 0000000. The write value should be 0000000.</description>
                            <lsb>9</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SQCH0SET0R_LL</name>
                    <description>Sequence Channel 0 Set 0 Register</description>
                    <alternateRegister>SQCH0SET0R</alternateRegister>
                    <addressOffset>0x5C0</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>START</name>
                            <description>Sequence Operation Start</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>write-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>No operation</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Start the sequence operation</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>This bit is read as 0. The write value should be 0.</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>These bits are read as 00. The write value should be 00.</description>
                            <lsb>2</lsb>
                            <msb>3</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>These bits are read as 0000. The write value should be 0000.</description>
                            <lsb>4</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SQCH0SET0R_LH</name>
                    <description>Sequence Channel 0 Set 0 Register</description>
                    <alternateRegister>SQCH0SET0R</alternateRegister>
                    <addressOffset>0x5C1</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>Reserved</name>
                            <description>This bit is read as 0. The write value should be 0.</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>These bits are read as 0000000. The write value should be 0000000.</description>
                            <lsb>1</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SQCH0SET0R_H</name>
                    <description>Sequence Channel 0 Set 0 Register</description>
                    <alternateRegister>SQCH0SET0R</alternateRegister>
                    <addressOffset>0x5C2</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0080</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>Reserved</name>
                            <description>These bits are read as 0000000. The write value should be 0000000.</description>
                            <lsb>0</lsb>
                            <msb>6</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>This bit is read as 1. The write value should be 1.</description>
                            <lsb>7</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>These bits are read as 0000000. The write value should be 0000000.</description>
                            <lsb>8</lsb>
                            <msb>14</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>This bit is read as 0. The write value should be 0.</description>
                            <lsb>15</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SQCH0SET0R_HL</name>
                    <description>Sequence Channel 0 Set 0 Register</description>
                    <alternateRegister>SQCH0SET0R</alternateRegister>
                    <addressOffset>0x5C2</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x80</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>Reserved</name>
                            <description>These bits are read as 0000000. The write value should be 0000000.</description>
                            <lsb>0</lsb>
                            <msb>6</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>This bit is read as 1. The write value should be 1.</description>
                            <lsb>7</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SQCH0SET0R_HH</name>
                    <description>Sequence Channel 0 Set 0 Register</description>
                    <alternateRegister>SQCH0SET0R</alternateRegister>
                    <addressOffset>0x5C3</addressOffset>
                    <size>8</size>
                    <access>write-only</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>Reserved</name>
                            <description>The write value should be 0000000.</description>
                            <lsb>0</lsb>
                            <msb>6</msb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>The write value should be 0.</description>
                            <lsb>7</lsb>
                            <msb>7</msb>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
