ra-rs/ra/svd/vendor/R7FA8M1AH.svd
                <register>
                    <dim>8</dim>
                    <dimIncrement>0x010</dimIncrement>
                    <dimIndex>0-7</dimIndex>
                    <name>SQCH0DSC%sCR_HL</name>
                    <description>Sequence Channel 0 Descriptor-%s C Register</description>
                    <alternateRegister>SQCH0DSC%sCR</alternateRegister>
                    <addressOffset>0x78A</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>Reserved</name>
                            <description>These bits are read as 000000. The write value should be 000000.</description>
                            <lsb>0</lsb>
                            <msb>5</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>AUXOP</name>
                            <description>Auxiliary Operation</description>
                            <lsb>6</lsb>
                            <msb>6</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Not use auxiliary operation</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Execute auxiliary operation</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>This bit is read as 0. The write value should be 0.</description>
                            <lsb>7</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>8</dim>
                    <dimIncrement>0x010</dimIncrement>
                    <dimIndex>0-7</dimIndex>
                    <name>SQCH0DSC%sCR_HH</name>
                    <description>Sequence Channel 0 Descriptor-%s C Register</description>
                    <alternateRegister>SQCH0DSC%sCR</alternateRegister>
                    <addressOffset>0x78B</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>ACTCODE</name>
                            <description>Action Code</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>00000000</name>
                                    <description>Slot-0 (RXRSS0R)</description>
                                    <value>#00000000</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>00000001</name>
                                    <description>Slot-1 (RXRSS1R)</description>
                                    <value>#00000001</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>00000010</name>
                                    <description>Slot-2 (RXRSS2R)</description>
                                    <value>#00000010</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>00000011</name>
                                    <description>Slot-3 (RXRSS3R)</description>
                                    <value>#00000011</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>00000000</name>
                                    <description>Send Reset-Trigger </description>
                                    <value>#00000000</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>00000100</name>
                                    <description>Send Initial Skew calibration</description>
                                    <value>#00000100</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>00000101</name>
                                    <description>Send Periodic Skew calibration</description>
                                    <value>#00000101</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>00001000</name>
                                    <description>No-operation </description>
                                    <value>#00001000</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>8</dim>
                    <dimIncrement>0x010</dimIncrement>
                    <dimIndex>0-7</dimIndex>
                    <name>SQCH0DSC%sDR</name>
                    <description>Sequence Channel 0 Descriptor-%s D Register</description>
                    <addressOffset>0x78C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x00000000</resetMask>
                    <fields>
                        <field>
                            <name>LADDR</name>
                            <description>Lower Address</description>
                            <lsb>0</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>8</dim>
                    <dimIncrement>0x010</dimIncrement>
                    <dimIndex>0-7</dimIndex>
                    <name>SQCH0DSC%sDR_L</name>
                    <description>Sequence Channel 0 Descriptor-%s D Register</description>
                    <alternateRegister>SQCH0DSC%sDR</alternateRegister>
                    <addressOffset>0x78C</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>LADDR</name>
                            <description>Lower Address</description>
                            <lsb>0</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>8</dim>
                    <dimIncrement>0x010</dimIncrement>
                    <dimIndex>0-7</dimIndex>
                    <name>SQCH0DSC%sDR_LL</name>
                    <description>Sequence Channel 0 Descriptor-%s D Register</description>
                    <alternateRegister>SQCH0DSC%sDR</alternateRegister>
                    <addressOffset>0x78C</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>LADDR</name>
                            <description>Lower Address</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>8</dim>
                    <dimIncrement>0x010</dimIncrement>
                    <dimIndex>0-7</dimIndex>
                    <name>SQCH0DSC%sDR_LH</name>
                    <description>Sequence Channel 0 Descriptor-%s D Register</description>
                    <alternateRegister>SQCH0DSC%sDR</alternateRegister>
                    <addressOffset>0x78D</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>LADDR</name>
                            <description>Lower Address</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>8</dim>
                    <dimIncrement>0x010</dimIncrement>
                    <dimIndex>0-7</dimIndex>
                    <name>SQCH0DSC%sDR_H</name>
                    <description>Sequence Channel 0 Descriptor-%s D Register</description>
                    <alternateRegister>SQCH0DSC%sDR</alternateRegister>
                    <addressOffset>0x78E</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>LADDR</name>
                            <description>Lower Address</description>
                            <lsb>0</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>8</dim>
                    <dimIncrement>0x010</dimIncrement>
                    <dimIndex>0-7</dimIndex>
                    <name>SQCH0DSC%sDR_HL</name>
                    <description>Sequence Channel 0 Descriptor-%s D Register</description>
                    <alternateRegister>SQCH0DSC%sDR</alternateRegister>
                    <addressOffset>0x78E</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>LADDR</name>
                            <description>Lower Address</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>8</dim>
                    <dimIncrement>0x010</dimIncrement>
                    <dimIndex>0-7</dimIndex>
                    <name>SQCH0DSC%sDR_HH</name>
                    <description>Sequence Channel 0 Descriptor-%s D Register</description>
                    <alternateRegister>SQCH0DSC%sDR</alternateRegister>
                    <addressOffset>0x78F</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>LADDR</name>
                            <description>Lower Address</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>8</dim>
                    <dimIncrement>0x010</dimIncrement>
                    <dimIndex>0-7</dimIndex>
                    <name>SQCH1DSC%sAR</name>
                    <description>Sequence Channel 1 Descriptor-%s A Register</description>
                    <addressOffset>0x800</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x00000000</resetMask>
                    <fields>
                        <field>
                            <name>DATA0</name>
                            <description>Data 0</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DATA1</name>
                            <description>Data 1</description>
                            <lsb>8</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DT</name>
                            <description>Data Type</description>
                            <lsb>16</lsb>
                            <msb>21</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>VC</name>
                            <description>Virtual Channel</description>
                            <lsb>22</lsb>
                            <msb>23</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>FMT</name>
                            <description>Format</description>
                            <lsb>24</lsb>
                            <msb>24</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Short Packet</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Long Packet</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>SPD</name>
                            <description>Speed</description>
                            <lsb>25</lsb>
                            <msb>25</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>High Speed</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Low Power</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>BTA</name>
                            <description>Bus Turn Around</description>
                            <lsb>26</lsb>
                            <msb>27</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>00</name>
                                    <description>Not assert BTA or No-operation</description>
                                    <value>#00</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>01</name>
                                    <description>Assert BTA </description>
                                    <value>#01</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>10</name>
                                    <description>Assert BTA followed by READ request (No WRITE request before BTA)</description>
                                    <value>#10</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>11</name>
                                    <description>Assert BTA only (No WRITE request before BTA)</description>
                                    <value>#11</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>NXACT</name>
                            <description>Next Action</description>
                            <lsb>28</lsb>
                            <msb>29</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>00</name>
                                    <description>Terminate the sequence operation after this descriptor processing is finished. </description>
                                    <value>#00</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>01</name>
                                    <description>Start the next descriptor processing after this descriptor processing is finished. </description>
                                    <value>#01</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>These bits are read as 00. The write value should be 00.</description>
                            <lsb>30</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>8</dim>
                    <dimIncrement>0x010</dimIncrement>
                    <dimIndex>0-7</dimIndex>
                    <name>SQCH1DSC%sAR_L</name>
                    <description>Sequence Channel 1 Descriptor-%s A Register</description>
                    <alternateRegister>SQCH1DSC%sAR</alternateRegister>
                    <addressOffset>0x800</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>DATA0</name>
                            <description>Data 0</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DATA1</name>
                            <description>Data 1</description>
                            <lsb>8</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>8</dim>
                    <dimIncrement>0x010</dimIncrement>
                    <dimIndex>0-7</dimIndex>
                    <name>SQCH1DSC%sAR_LL</name>
                    <description>Sequence Channel 1 Descriptor-%s A Register</description>
                    <alternateRegister>SQCH1DSC%sAR</alternateRegister>
                    <addressOffset>0x800</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>DATA0</name>
                            <description>Data 0</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>8</dim>
                    <dimIncrement>0x010</dimIncrement>
                    <dimIndex>0-7</dimIndex>
                    <name>SQCH1DSC%sAR_LH</name>
                    <description>Sequence Channel 1 Descriptor-%s A Register</description>
                    <alternateRegister>SQCH1DSC%sAR</alternateRegister>
                    <addressOffset>0x801</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>DATA1</name>
                            <description>Data 1</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
