ra-rs/ra/svd/vendor/R7FA8M1AH.svd
                <register>
                    <name>DVSTCTR0</name>
                    <description>Device State Control Register 0</description>
                    <addressOffset>0x008</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0x07F7</resetMask>
                    <fields>
                        <field>
                            <name>RHST</name>
                            <description>USB Bus Reset Status</description>
                            <lsb>0</lsb>
                            <msb>2</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>000</name>
                                    <description>Communication speed not determined</description>
                                    <value>#000</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>001</name>
                                    <description>Low-speed connection(When the host controller function is selected) /USB bus reset in progress or low-speed connection(When the function controller function is selected)</description>
                                    <value>#001</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>010</name>
                                    <description>Full-speed connection(When the host controller function is selected) /USB bus reset in progress or full-speed connection(When the function controller function is selected)</description>
                                    <value>#010</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>011</name>
                                    <description>Setting prohibited</description>
                                    <value>#011</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>others</name>
                                    <description>USB bus reset in progress(When the host controller function is selected)</description>
                                    <isDefault>true</isDefault>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>This bit is read as 0. The write value should be 0.</description>
                            <lsb>3</lsb>
                            <msb>3</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>UACT</name>
                            <description>USB Bus Enable</description>
                            <lsb>4</lsb>
                            <msb>4</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Downstream port is disabled (SOF or micro-SOF transmission is disabled).</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Downstream port is enabled (SOF or micro-SOF transmission is enabled).</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>RESUME</name>
                            <description>Resume Output</description>
                            <lsb>5</lsb>
                            <msb>5</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Resume signal is not output.</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Resume signal is output.</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>USBRST</name>
                            <description>USB Bus Reset Output</description>
                            <lsb>6</lsb>
                            <msb>6</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>USB bus reset signal is not output.</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>USB bus reset signal is output.</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>RWUPE</name>
                            <description>Remote Wakeup Detection Enable</description>
                            <lsb>7</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Downstream-port remote wakeup is disabled.</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Downstream-port remote wakeup is enabled.</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>WKUP</name>
                            <description>Wakeup Output</description>
                            <lsb>8</lsb>
                            <msb>8</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Remote wakeup signal is not output.</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Remote wakeup signal is output.</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>VBUSEN</name>
                            <description>USB0_VBUSEN Output Pin ControlThe VBUSEN bit value is output as the status of the external USB0_VBUSEN pin without change.</description>
                            <lsb>9</lsb>
                            <msb>9</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EXICEN</name>
                            <description>USB0_EXICEN Output Pin ControlThe EXICEN bit value is output as the status of the external USB0_EXICEN pin without change.</description>
                            <lsb>10</lsb>
                            <msb>10</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>HNPBTOA</name>
                            <description>Host Negotiation Protocol (HNP) Control     This bit is used when switching from device B to device A while in OTG mode. If the HNPBTOA bit is 1, the internal function control keeps the suspended state until the HNP processing ends even  though SYSCFG.DPRPU = 0 or SYSCFG.DCFM = 1 is set.</description>
                            <lsb>11</lsb>
                            <msb>11</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Normal Operation</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Switching from device B to device A is enabled</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>These bits are read as 0000. The write value should be 0000.</description>
                            <lsb>12</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TESTMODE</name>
                    <description>USB Test Mode Register </description>
                    <addressOffset>0x00C</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0x000F</resetMask>
                    <fields>
                        <field>
                            <name>UTST</name>
                            <description>Test Mode</description>
                            <lsb>0</lsb>
                            <msb>3</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0000</name>
                                    <description>Normal operation</description>
                                    <value>#0000</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0001</name>
                                    <description>Test_J TestMode(When the Function Controller Function is Selected)</description>
                                    <value>#0001</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0010</name>
                                    <description>Test_K TestMode(When the Function Controller Function is Selected)</description>
                                    <value>#0010</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0011</name>
                                    <description>Test_SE0_NAK TestMode(When the Function Controller Function is Selected)</description>
                                    <value>#0011</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0100</name>
                                    <description>Test_Packet TestMode(When the Function Controller Function is Selected)</description>
                                    <value>#0100</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0101</name>
                                    <description>Reserved TestMode(When the Function Controller Function is Selected)</description>
                                    <value>#0101</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0110</name>
                                    <description>Reserved TestMode(When the Function Controller Function is Selected)</description>
                                    <value>#0110</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0111</name>
                                    <description>Reserved TestMode(When the Function Controller Function is Selected)</description>
                                    <value>#0111</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1001</name>
                                    <description>Test_J TestMode(When the Host Controller Function is Selected)</description>
                                    <value>#1001</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1010</name>
                                    <description>Test_K TestMode(When the Host Controller Function is Selected)</description>
                                    <value>#1010</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1011</name>
                                    <description>Test_SE0_NAK TestMode(When the Host Controller Function is Selected)</description>
                                    <value>#1011</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1100</name>
                                    <description>Test_Packet TestMode(When the Host Controller Function is Selected)</description>
                                    <value>#1100</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1101</name>
                                    <description>Test_Force_EnableTestMode(When the Host Controller Function is Selected)</description>
                                    <value>#1101</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1110</name>
                                    <description>Reserved TestMode(When the Host Controller Function is Selected)</description>
                                    <value>#1110</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1111</name>
                                    <description>Reserved TestMode(When the Host Controller Function is Selected)</description>
                                    <value>#1111</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>These bits are read as 000000000000. The write value should be 000000000000.</description>
                            <lsb>4</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CFIFO</name>
                    <description>CFIFO Port Register</description>
                    <addressOffset>0x014</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>FIFOPORT</name>
                            <description>FIFO Port.Read receive data from the FIFO buffer or write transmit data to the FIFO buffer by accessing these bits.</description>
                            <lsb>0</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CFIFOL</name>
                    <description>CFIFO Port Register L</description>
                    <alternateRegister>CFIFO</alternateRegister>
                    <addressOffset>0x014</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xFFFF</resetMask>
                </register>
                <register>
                    <name>CFIFOLL</name>
                    <description>CFIFO Port Register LL</description>
                    <alternateRegister>CFIFOL</alternateRegister>
                    <addressOffset>0x014</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>CFIFOH</name>
                    <description>CFIFO Port Register H</description>
                    <alternateRegister>CFIFO</alternateRegister>
                    <addressOffset>0x016</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xFFFF</resetMask>
                </register>
                <register>
                    <name>CFIFOHH</name>
                    <description>CFIFO Port Register HH</description>
                    <alternateRegister>CFIFOH</alternateRegister>
                    <addressOffset>0x017</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>D0FIFO</name>
                    <description>D0FIFO Port Register</description>
                    <addressOffset>0x018</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>FIFOPORT</name>
                            <description>FIFO Port Read receive data from the FIFO buffer or write transmit data to the FIFO buffer by accessing these bits.</description>
                            <lsb>0</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>D0FIFOL</name>
                    <description>D0FIFO Port Register L</description>
                    <alternateRegister>D0FIFO</alternateRegister>
                    <addressOffset>0x018</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xFFFF</resetMask>
                </register>
                <register>
                    <name>D0FIFOLL</name>
                    <description>D0FIFO Port Register LL</description>
                    <alternateRegister>D0FIFOL</alternateRegister>
                    <addressOffset>0x018</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>D0FIFOH</name>
                    <description>D0FIFO Port Register H</description>
                    <alternateRegister>D0FIFO</alternateRegister>
                    <addressOffset>0x01A</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xFFFF</resetMask>
                </register>
                <register>
                    <name>D0FIFOHH</name>
                    <description>D0FIFO Port Register HH</description>
                    <alternateRegister>D0FIFOH</alternateRegister>
                    <addressOffset>0x01B</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>D1FIFO</name>
                    <description>D1FIFO Port Register</description>
                    <addressOffset>0x01C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>FIFOPORT</name>
                            <description>FIFO PortRead receive data from the FIFO buffer or write transmit data to the FIFO buffer by accessing these bits.</description>
                            <lsb>0</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
