ra-rs/ra/svd/vendor/R7FA8M1AH.svd
                <register>
                    <name>EESR</name>
                    <description>ETHERC/EDMAC Status Register</description>
                    <addressOffset>0x28</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>CERF</name>
                            <description>CRC Error Flag</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                            <modifiedWriteValues>oneToClear</modifiedWriteValues>
                            <readAction>modify</readAction>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>CRC error has not been detected.</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>CRC error has been detected.</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>PRE</name>
                            <description>PHY-LSI Receive Error Flag</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                            <modifiedWriteValues>oneToClear</modifiedWriteValues>
                            <readAction>modify</readAction>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>PHY-LSI receive error has not been detected.</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>PHY-LSI receive error has been detected.</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>RTSF</name>
                            <description>Frame-Too-Short Error Flag</description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>read-write</access>
                            <modifiedWriteValues>oneToClear</modifiedWriteValues>
                            <readAction>modify</readAction>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Frame-too-short error has not been detected.</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Frame-too-short error has been detected.</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>RTLF</name>
                            <description>Frame-Too-Long Error Flag</description>
                            <lsb>3</lsb>
                            <msb>3</msb>
                            <access>read-write</access>
                            <modifiedWriteValues>oneToClear</modifiedWriteValues>
                            <readAction>modify</readAction>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Frame-too-long error has not been detected.</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Frame-too-long error has been detected.</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>RRF</name>
                            <description>Alignment Error Flag</description>
                            <lsb>4</lsb>
                            <msb>4</msb>
                            <access>read-write</access>
                            <modifiedWriteValues>oneToClear</modifiedWriteValues>
                            <readAction>modify</readAction>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Alignment error has not been detected.</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Alignment error has been detected.</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>These bits are read as 00. The write value should be 00.</description>
                            <lsb>5</lsb>
                            <msb>6</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RMAF</name>
                            <description>Multicast Address Frame Receive Flag</description>
                            <lsb>7</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                            <modifiedWriteValues>oneToClear</modifiedWriteValues>
                            <readAction>modify</readAction>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Multicast address frame has not been received.</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Multicast address frame has been received.</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>TRO</name>
                            <description>Transmit Retry Over Flag</description>
                            <lsb>8</lsb>
                            <msb>8</msb>
                            <access>read-write</access>
                            <modifiedWriteValues>oneToClear</modifiedWriteValues>
                            <readAction>modify</readAction>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Transmit retry-over condition has not been detected.</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Transmit retry-over condition has been detected.</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>CD</name>
                            <description>Late Collision Detect Flag</description>
                            <lsb>9</lsb>
                            <msb>9</msb>
                            <access>read-write</access>
                            <modifiedWriteValues>oneToClear</modifiedWriteValues>
                            <readAction>modify</readAction>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Late collision has not been detected.</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Late collision has been detected during frame transmission.</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>DLC</name>
                            <description>Loss of Carrier Detect Flag</description>
                            <lsb>10</lsb>
                            <msb>10</msb>
                            <access>read-write</access>
                            <modifiedWriteValues>oneToClear</modifiedWriteValues>
                            <readAction>modify</readAction>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Loss of carrier has not been detected.</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Loss of carrier has been detected during frame transmission.</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>CND</name>
                            <description>Carrier Not Detect Flag</description>
                            <lsb>11</lsb>
                            <msb>11</msb>
                            <access>read-write</access>
                            <modifiedWriteValues>oneToClear</modifiedWriteValues>
                            <readAction>modify</readAction>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>A carrier has been detected when transmission starts.</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>A carrier has not been detected during preamble transmission.</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>These bits are read as 0000. The write value should be 0000.</description>
                            <lsb>12</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RFOF</name>
                            <description>Receive FIFO Overflow Flag</description>
                            <lsb>16</lsb>
                            <msb>16</msb>
                            <access>read-write</access>
                            <modifiedWriteValues>oneToClear</modifiedWriteValues>
                            <readAction>modify</readAction>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Overflow has not occurred.</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Overflow has occurred.</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>RDE</name>
                            <description>Receive Descriptor Empty Flag</description>
                            <lsb>17</lsb>
                            <msb>17</msb>
                            <access>read-write</access>
                            <modifiedWriteValues>oneToClear</modifiedWriteValues>
                            <readAction>modify</readAction>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>The EDMAC detects that the receive descriptor valid bit (RDn.RACT) is 1.</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>The EDMAC detects that the receive descriptor valid bit (RDn.RACT) is 0.</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>FR</name>
                            <description>Frame Receive Flag</description>
                            <lsb>18</lsb>
                            <msb>18</msb>
                            <access>read-write</access>
                            <modifiedWriteValues>oneToClear</modifiedWriteValues>
                            <readAction>modify</readAction>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Frame has not been received.</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Frame has been received. Update of the receive descriptor is complete.</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>TFUF</name>
                            <description>Transmit FIFO Underflow Flag</description>
                            <lsb>19</lsb>
                            <msb>19</msb>
                            <access>read-write</access>
                            <modifiedWriteValues>oneToClear</modifiedWriteValues>
                            <readAction>modify</readAction>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Underflow has not occurred.</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Underflow has occurred.</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>TDE</name>
                            <description>Transmit Descriptor Empty Flag</description>
                            <lsb>20</lsb>
                            <msb>20</msb>
                            <access>read-write</access>
                            <modifiedWriteValues>oneToClear</modifiedWriteValues>
                            <readAction>modify</readAction>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>The EDMAC detects that the transmit descriptor valid bit (TDn.TACT) is 1.</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>The EDMAC detects that the transmit descriptor valid bit (TDn.TACT) is 0.</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>TC</name>
                            <description>Frame Transfer Complete Flag</description>
                            <lsb>21</lsb>
                            <msb>21</msb>
                            <access>read-write</access>
                            <modifiedWriteValues>oneToClear</modifiedWriteValues>
                            <readAction>modify</readAction>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Transfer have not been completed, or no transfer has been requested.</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>All frames indicated by the transmit descriptor have been completely transferred to the transmit FIFO.</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>ECI</name>
                            <description>ETHERC Status Register Source FlagNOTE: When the source in the ETHERCn.ECSR register is cleared, the ECI flag is also cleared.</description>
                            <lsb>22</lsb>
                            <msb>22</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>ETHERC status interrupt source has not been detected.</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>ETHERC status interrupt source has been detected.</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>ADE</name>
                            <description>Address Error Flag</description>
                            <lsb>23</lsb>
                            <msb>23</msb>
                            <access>read-write</access>
                            <modifiedWriteValues>oneToClear</modifiedWriteValues>
                            <readAction>modify</readAction>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Invalid memory address has not been detected (normal operation).</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Invalid memory address has been detected. </description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>RFCOF</name>
                            <description>Receive Frame Counter Overflow Flag</description>
                            <lsb>24</lsb>
                            <msb>24</msb>
                            <access>read-write</access>
                            <modifiedWriteValues>oneToClear</modifiedWriteValues>
                            <readAction>modify</readAction>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Receive frame counter has not overflowed.</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Receive frame counter has overflowed.</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
