ra-rs/ra/svd/vendor/R7FA8M1AH.svd
                <register>
                    <name>CCR3_BY_HL</name>
                    <description>Common Control Register 3</description>
                    <addressOffset>0x0016</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>MOD</name>
                            <description>communication MODe select bit</description>
                            <lsb>0</lsb>
                            <msb>2</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>000</name>
                                    <description>Asynchronous</description>
                                    <value>#000</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>001</name>
                                    <description>Smart card interface</description>
                                    <value>#001</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>010</name>
                                    <description>Clock snchronous</description>
                                    <value>#010</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>011</name>
                                    <description>Simple-SPI</description>
                                    <value>#011</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>100</name>
                                    <description>Simple-I2C</description>
                                    <value>#100</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>101</name>
                                    <description>Manchester</description>
                                    <value>#101</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>110</name>
                                    <description>Simple-LIN</description>
                                    <value>#110</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>111</name>
                                    <description>Prohibit</description>
                                    <value>#111</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>MP</name>
                            <description>Multi-Processor mode</description>
                            <lsb>3</lsb>
                            <msb>3</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Multi-processor communications function is disabled</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Multi-processor communications function is enabled</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>FM</name>
                            <description>FIFO Mode Select</description>
                            <lsb>4</lsb>
                            <msb>4</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Non-FIFO mode</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>FIFO mode </description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>DEN</name>
                            <description>Driver control Enable</description>
                            <lsb>5</lsb>
                            <msb>5</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>RS-485 driver control function is enable</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>RS-485 driver control function is disable</description>
                                    <value>#0</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>These bits are read as 00. The write value should be 00.</description>
                            <lsb>6</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CCR3_BY_HH</name>
                    <description>Common Control Register 3</description>
                    <addressOffset>0x0017</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>CKE</name>
                            <description>Clock Enable</description>
                            <lsb>0</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>00</name>
                                    <description>On-chip baud rate generator</description>
                                    <value>#00</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name />
                                    <description>The SCKn pin is available for use as an I/O port in accord with the I/O </description>
                                    <value>#</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name />
                                    <description>port settings.</description>
                                    <value>#</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>01</name>
                                    <description>On-chip baud rate generator</description>
                                    <value>#01</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name />
                                    <description>The clock with the same frequency as the bit rate is output from the </description>
                                    <value>#</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name />
                                    <description>SCKn pin.</description>
                                    <value>#</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name />
                                    <description>• The clock with a frequency 16 times the bit rate should be input from </description>
                                    <value>#</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name />
                                    <description>the SCKn pin. (when CCR2.ABCS bit is “0”) Input a clock signal with </description>
                                    <value>#</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name />
                                    <description>a frequency 8 times the bit rate when the CCR2.ABCS bit is “1”.</description>
                                    <value>#</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name />
                                    <description>• The TMR clock can be used. The SCKn pin is available for use as an </description>
                                    <value>#</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name />
                                    <description>I/O port in accord with the I/O port settings when the TMR clock is used.</description>
                                    <value>#</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>00</name>
                                    <description>On-chip baud rate generator The SCKn pin functions as I/O port.</description>
                                    <value>#00</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>00</name>
                                    <description>Output disabled (The SCKn pin is available for use as an I/O port </description>
                                    <value>#00</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name />
                                    <description>in accord with the I/O port settings.)</description>
                                    <value>#</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>01</name>
                                    <description>Clock output</description>
                                    <value>#01</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>00</name>
                                    <description>Output fixed low</description>
                                    <value>#00</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>10</name>
                                    <description>Output fixed high</description>
                                    <value>#10</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>ACS0</name>
                            <description>Asynchronous Mode Clock Source Select</description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>External clock input</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Logical AND of two clock cycles output from the TMR</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>This bit is read as 0. The write value should be 0.</description>
                            <lsb>3</lsb>
                            <msb>3</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>GM</name>
                            <description>GSM Mode</description>
                            <lsb>4</lsb>
                            <msb>4</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Operates in non-GSM mode</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>It operates in GSM mode</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>BLK</name>
                            <description>Block transfer mode</description>
                            <lsb>5</lsb>
                            <msb>5</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Operates in non-block transfer mode.</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Operates in block transfer mode.</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>These bits are read as 00. The write value should be 00.</description>
                            <lsb>6</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
