ra-rs/ra/svd/vendor/R7FA8M1AH.svd
                <register>
                    <name>BSTFC_BY_LH</name>
                    <description>Bus Status Force Register</description>
                    <addressOffset>0x1DD</addressOffset>
                    <size>8</size>
                    <access>write-only</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>TENDFC</name>
                            <description>Transmit End Force</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>write-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>not Force Transmit End Interrupt for software testing.</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Force Transmit End Interrupt for software testing.</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>The write value should be 0000000.</description>
                            <lsb>1</lsb>
                            <msb>7</msb>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>BSTFC_HA_H</name>
                    <description>Bus Status Force Register</description>
                    <addressOffset>0x1DE</addressOffset>
                    <size>16</size>
                    <access>write-only</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>ALFC</name>
                            <description>Arbitration Lost Force</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>write-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>not Force Arbitration Lost Interrupt for software testing.</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Force Arbitration Lost Interrupt for software testing.</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>The write value should be 000.</description>
                            <lsb>1</lsb>
                            <msb>3</msb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>TODFC</name>
                            <description>Timeout Detection Force</description>
                            <lsb>4</lsb>
                            <msb>4</msb>
                            <access>write-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>not Force Timeout Detection Interrupt for software testing.</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Force Timeout Detection Interrupt for software testing.</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>The write value should be 000.</description>
                            <lsb>5</lsb>
                            <msb>7</msb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>WUCNDDFC</name>
                            <description>Wake-Up Condition Detection Force</description>
                            <lsb>8</lsb>
                            <msb>8</msb>
                            <access>write-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>not Force Wake-Up Condition Detection Interrupt for software testing.</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Force Wake-Up Condition Detection Interrupt for software testing.</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>The write value should be 0000000.</description>
                            <lsb>9</lsb>
                            <msb>15</msb>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>BSTFC_BY_HL</name>
                    <description>Bus Status Force Register</description>
                    <addressOffset>0x1DE</addressOffset>
                    <size>8</size>
                    <access>write-only</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>ALFC</name>
                            <description>Arbitration Lost Force</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>write-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>not Force Arbitration Lost Interrupt for software testing.</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Force Arbitration Lost Interrupt for software testing.</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>The write value should be 000.</description>
                            <lsb>1</lsb>
                            <msb>3</msb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>TODFC</name>
                            <description>Timeout Detection Force</description>
                            <lsb>4</lsb>
                            <msb>4</msb>
                            <access>write-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>not Force Timeout Detection Interrupt for software testing.</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Force Timeout Detection Interrupt for software testing.</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>The write value should be 000.</description>
                            <lsb>5</lsb>
                            <msb>7</msb>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>BSTFC_BY_HH</name>
                    <description>Bus Status Force Register</description>
                    <addressOffset>0x1DF</addressOffset>
                    <size>8</size>
                    <access>write-only</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>WUCNDDFC</name>
                            <description>Wake-Up Condition Detection Force</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>write-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>not Force Wake-Up Condition Detection Interrupt for software testing.</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Force Wake-Up Condition Detection Interrupt for software testing.</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>The write value should be 0000000.</description>
                            <lsb>1</lsb>
                            <msb>7</msb>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
