ra-rs/ra/svd/vendor/R7FA8M1AH.svd
                <register>
                    <name>CETSM_HA_H</name>
                    <description>CCC Exchange Timing Support Information M(Mode ) Register</description>
                    <addressOffset>0x376</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>INAC</name>
                            <description>Inaccuracy ByteThis byte represents the maximum variation of the Slave's internal oscillator in 1/10th percent (0.1%) increments, up to 25.5%.</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0x00</name>
                                    <description>0.0%</description>
                                    <value>0x00</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0x0F</name>
                                    <description>1.5%</description>
                                    <value>0x0F</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0x1F</name>
                                    <description>3.1%</description>
                                    <value>0x1F</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0x2F</name>
                                    <description>4.7%</description>
                                    <value>0x2F</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0x3F</name>
                                    <description>6.3%</description>
                                    <value>0x3F</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0x4F</name>
                                    <description>7.9%</description>
                                    <value>0x4F</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0x5F</name>
                                    <description>9.5%</description>
                                    <value>0x5F</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0x6F</name>
                                    <description>11.1%</description>
                                    <value>0x6F</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0x7F</name>
                                    <description>12.7%</description>
                                    <value>0x7F</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0x8F</name>
                                    <description>14.3%</description>
                                    <value>0x8F</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0x9F</name>
                                    <description>15.9%</description>
                                    <value>0x9F</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0xAF</name>
                                    <description>17.5%</description>
                                    <value>0xAF</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0xBF</name>
                                    <description>19.1%</description>
                                    <value>0xBF</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0xCF</name>
                                    <description>20.7%</description>
                                    <value>0xCF</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0xDF</name>
                                    <description>22.3%</description>
                                    <value>0xDF</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0xEF</name>
                                    <description>23.9%</description>
                                    <value>0xEF</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0xFF</name>
                                    <description>25.5%</description>
                                    <value>0xFF</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>These bits are read as 00000000. The write value should be 00000000.</description>
                            <lsb>8</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CETSM_BY_HL</name>
                    <description>CCC Exchange Timing Support Information M(Mode ) Register</description>
                    <addressOffset>0x376</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>INAC</name>
                            <description>Inaccuracy ByteThis byte represents the maximum variation of the Slave's internal oscillator in 1/10th percent (0.1%) increments, up to 25.5%.</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0x00</name>
                                    <description>0.0%</description>
                                    <value>0x00</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0x0F</name>
                                    <description>1.5%</description>
                                    <value>0x0F</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0x1F</name>
                                    <description>3.1%</description>
                                    <value>0x1F</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0x2F</name>
                                    <description>4.7%</description>
                                    <value>0x2F</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0x3F</name>
                                    <description>6.3%</description>
                                    <value>0x3F</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0x4F</name>
                                    <description>7.9%</description>
                                    <value>0x4F</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0x5F</name>
                                    <description>9.5%</description>
                                    <value>0x5F</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0x6F</name>
                                    <description>11.1%</description>
                                    <value>0x6F</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0x7F</name>
                                    <description>12.7%</description>
                                    <value>0x7F</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0x8F</name>
                                    <description>14.3%</description>
                                    <value>0x8F</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0x9F</name>
                                    <description>15.9%</description>
                                    <value>0x9F</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0xAF</name>
                                    <description>17.5%</description>
                                    <value>0xAF</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0xBF</name>
                                    <description>19.1%</description>
                                    <value>0xBF</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0xCF</name>
                                    <description>20.7%</description>
                                    <value>0xCF</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0xDF</name>
                                    <description>22.3%</description>
                                    <value>0xDF</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0xEF</name>
                                    <description>23.9%</description>
                                    <value>0xEF</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0xFF</name>
                                    <description>25.5%</description>
                                    <value>0xFF</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CETSS</name>
                    <description>CCC Exchange Timing Support Information S(State ) Register</description>
                    <addressOffset>0x378</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>SYNE</name>
                            <description>Sync Mode Enabled</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Sync Mode Disabled.</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Sync Mode Enabled.</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>ASYNE</name>
                            <description>Async Mode Enabled</description>
                            <lsb>1</lsb>
                            <msb>2</msb>
                            <access>read-write</access>
                            <readAction>modify</readAction>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>00</name>
                                    <description>All Mode Disable</description>
                                    <value>#00</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>01</name>
                                    <description>Async Mode 0 Enabled.</description>
                                    <value>#01</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>10</name>
                                    <description>Async Mode 1 Enabled.</description>
                                    <value>#10</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>These bits are read as 0000. The write value should be 0000.</description>
                            <lsb>3</lsb>
                            <msb>6</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ICOVF</name>
                            <description>Internal Counter Overflow</description>
                            <lsb>7</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                            <readAction>modify</readAction>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Slave has not experienced a counter overflow since the most recent previous check.</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Slave experienced a counter overflow since the most recent previous check.</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>These bits are read as 000000000000000000000000. The write value should be 000000000000000000000000.</description>
                            <lsb>8</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CETSS_HA_L</name>
                    <description>CCC Exchange Timing Support Information S(State ) Register</description>
                    <addressOffset>0x378</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>SYNE</name>
                            <description>Sync Mode Enabled</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Sync Mode Disabled.</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Sync Mode Enabled.</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>ASYNE</name>
                            <description>Async Mode Enabled</description>
                            <lsb>1</lsb>
                            <msb>2</msb>
                            <access>read-write</access>
                            <readAction>modify</readAction>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>00</name>
                                    <description>All Mode Disable</description>
                                    <value>#00</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>01</name>
                                    <description>Async Mode 0 Enabled.</description>
                                    <value>#01</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>10</name>
                                    <description>Async Mode 1 Enabled.</description>
                                    <value>#10</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>These bits are read as 0000. The write value should be 0000.</description>
                            <lsb>3</lsb>
                            <msb>6</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ICOVF</name>
                            <description>Internal Counter Overflow</description>
                            <lsb>7</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                            <readAction>modify</readAction>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Slave has not experienced a counter overflow since the most recent previous check.</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Slave experienced a counter overflow since the most recent previous check.</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>These bits are read as 00000000. The write value should be 00000000.</description>
                            <lsb>8</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
