ra-rs/ra/svd/vendor/R7FA8M1AH.svd
                <register>
                    <name>CFDGSTS</name>
                    <description>Global Status Register</description>
                    <addressOffset>0x001C</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0000000D</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>GRSTSTS</name>
                            <description>Global Reset Status</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Not in Reset Mode</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>In Reset Mode</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>GHLTSTS</name>
                            <description>Global Halt Status</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Not in Halt Mode</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>In Halt Mode</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>GSLPSTS</name>
                            <description>Global Sleep Status</description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Not in Sleep Mode</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>In Sleep Mode</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>GRAMINIT</name>
                            <description>Global RAM Initialisation</description>
                            <lsb>3</lsb>
                            <msb>3</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>RAM initialisation is finished</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>RAM initialisation ongoing</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>These bits are read as 0000000000000000000000000000.</description>
                            <lsb>4</lsb>
                            <msb>31</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CFDGERFL</name>
                    <description>Global Error Flag Register</description>
                    <addressOffset>0x0020</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>DEF</name>
                            <description>DLC Error Flag</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>DLC Error detected</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>MES</name>
                            <description>Message Lost Error Status</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Message lost Error not detected</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Message lost Error detected</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>THLES</name>
                            <description>TX History List Entry Lost Error Status</description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>TX History List Entry Lost Error not detected</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>TX History List Entry Lost Error detected</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>CMPOF</name>
                            <description>CAN-FD message payload overflow Flag</description>
                            <lsb>3</lsb>
                            <msb>3</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>CAN-FD message payload overflow not detected</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>CAN-FD message payload overflow detected</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>This bit is read as 0. The write value should be 0.</description>
                            <lsb>4</lsb>
                            <msb>4</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>OTBMLTSTS</name>
                            <description>OTB FIFO Message Lost Status </description>
                            <lsb>5</lsb>
                            <msb>5</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Message lost Error not detected</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Message lost Error detected</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>These bits are read as 00. The write value should be 00.</description>
                            <lsb>6</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RXSFAIL</name>
                            <description>RX Scan Fail</description>
                            <lsb>8</lsb>
                            <msb>8</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>RX Scan fail not detected</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>RX Scan fail detected</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>These bits are read as 0000000. The write value should be 0000000.</description>
                            <lsb>9</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EEF</name>
                            <description>ECC Error Flag</description>
                            <lsb>16</lsb>
                            <msb>16</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>ECC Error not detected during TX-SCAN</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>ECC Error detected during TX-SCAN</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>These bits are read as 000000000000000. The write value should be 000000000000000.</description>
                            <lsb>17</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CFDGTSC</name>
                    <description>Global Timestamp Counter Register</description>
                    <addressOffset>0x0024</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>TS</name>
                            <description>Timestamp Value</description>
                            <lsb>0</lsb>
                            <msb>15</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>These bits are read as 0000000000000000.</description>
                            <lsb>16</lsb>
                            <msb>31</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CFDGAFLECTR</name>
                    <description>Global Acceptance Filter List Entry Control Register</description>
                    <addressOffset>0x0028</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>Reserved</name>
                            <description>This bit is read as 0. The write value should be 0.</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>These bits are read as 0000000. The write value should be 0000000.</description>
                            <lsb>1</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>AFLDAE</name>
                            <description>Acceptance Filter List Data Access Enable</description>
                            <lsb>8</lsb>
                            <msb>8</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Acceptance Filter List Data access disabled</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Acceptance Filter List Data access enabled</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>These bits are read as 00000000000000000000000. The write value should be 00000000000000000000000.</description>
                            <lsb>9</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CFDGAFLCFG</name>
                    <description>Global Acceptance Filter List Configuration Register</description>
                    <addressOffset>0x002C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>Reserved</name>
                            <description>These bits are read as 0000000000000000. The write value should be 0000000000000000.</description>
                            <lsb>0</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RNC</name>
                            <description>Rule Number</description>
                            <lsb>16</lsb>
                            <msb>21</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>These bits are read as 0000000000. The write value should be 0000000000.</description>
                            <lsb>22</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CFDRMNB</name>
                    <description>RX Message Buffer Number Register</description>
                    <addressOffset>0x0030</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>NRXMB</name>
                            <description>Number of RX Message Buffers</description>
                            <lsb>0</lsb>
                            <msb>5</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>These bits are read as 00. The write value should be 00.</description>
                            <lsb>6</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RMPLS</name>
                            <description>Reception Message Buffer Payload Data Size</description>
                            <lsb>8</lsb>
                            <msb>10</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>000</name>
                                    <description>8 Bytes</description>
                                    <value>#000</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>001</name>
                                    <description>12 Bytes</description>
                                    <value>#001</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>010</name>
                                    <description>16 Bytes</description>
                                    <value>#010</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>011</name>
                                    <description>20 Bytes</description>
                                    <value>#011</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>100</name>
                                    <description>24 Bytes</description>
                                    <value>#100</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>101</name>
                                    <description>32 Bytes</description>
                                    <value>#101</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>110</name>
                                    <description>48 Bytes</description>
                                    <value>#110</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>111</name>
                                    <description>64 Bytes</description>
                                    <value>#111</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>These bits are read as 000000000000000000000. The write value should be 000000000000000000000.</description>
                            <lsb>11</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
