ra-rs/ra/svd/vendor/R7FA8M1AH.svd
                <register>
                    <name>CFDTXQSTS</name>
                    <description>TX Queue Status Registers0</description>
                    <addressOffset>0x0090</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000001</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>TXQEMP</name>
                            <description>TX Queue Empty</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>TX Queue Not Empty</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>TX Queue Empty</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>TXQFLL</name>
                            <description>TX Queue Full</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>TX Queue Not Full</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>TX Queue Full</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>TXQTXIF</name>
                            <description>TX Queue TX Interrupt Flag</description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>TX Queue interrupt condition not satisfied after Frame TX</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>TX Queue interrupt condition satisfied after Frame TX</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>These bits are read as 00000. The write value should be 00000.</description>
                            <lsb>3</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TXQMC</name>
                            <description>TX Queue Message Count</description>
                            <lsb>8</lsb>
                            <msb>10</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>These bits are read as 000000000000000000000. The write value should be 000000000000000000000.</description>
                            <lsb>11</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CFDTXQPCTR</name>
                    <description>TX Queue Pointer Control Register</description>
                    <addressOffset>0x0094</addressOffset>
                    <size>32</size>
                    <access>write-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>TXQPC</name>
                            <description>TX Queue Pointer Control</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>The write value should be 000000000000000000000000.</description>
                            <lsb>8</lsb>
                            <msb>31</msb>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CFDTHLCC</name>
                    <description>TX History List Configuration / Control Register</description>
                    <addressOffset>0x0098</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>THLE</name>
                            <description>TX History List Enable</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>TX History List disabled</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>TX History List enabled</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>These bits are read as 0000000. The write value should be 0000000.</description>
                            <lsb>1</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>THLIE</name>
                            <description>TX History List Interrupt Enable</description>
                            <lsb>8</lsb>
                            <msb>8</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>TX History List Interrupt disabled</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>TX History List Interrupt enabled</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>THLIM</name>
                            <description>TX History List Interrupt Mode</description>
                            <lsb>9</lsb>
                            <msb>9</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Interrupt generated if TX History List level reaches ¾ of the TX History List depth.</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Interrupt generated for every successfully stored entry</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>THLDTE</name>
                            <description>TX History List Dedicated TX Enable</description>
                            <lsb>10</lsb>
                            <msb>10</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>TX FIFO + TX Queue (TX FIFO  Only RL version)</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Flat TX MB + TX FIFO + TX Queue (Flat TX MB + TX FIFO  Only RL version)</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>These bits are read as 000000000000000000000. The write value should be 000000000000000000000.</description>
                            <lsb>11</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CFDTHLSTS</name>
                    <description>TX History List Status Register</description>
                    <addressOffset>0x009C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000001</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>THLEMP</name>
                            <description>TX History List Empty</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>TX History List Not Empty</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>TX History List Empty</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>THLFLL</name>
                            <description>TX History List Full</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>TX History List Not Full</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>TX History List Full</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>THLELT</name>
                            <description>TX History List Entry Lost</description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>No Entry Lost in TX History List</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>TX History List Entry Lost</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>THLIF</name>
                            <description>TX History List Interrupt Flag</description>
                            <lsb>3</lsb>
                            <msb>3</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>TX History List Interrupt condition not satisfied</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>TX History List Interrupt condition satisfied</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>These bits are read as 0000. The write value should be 0000.</description>
                            <lsb>4</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>THLMC</name>
                            <description>TX History List Message Count</description>
                            <lsb>8</lsb>
                            <msb>11</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>These bits are read as 00000000000000000000. The write value should be 00000000000000000000.</description>
                            <lsb>12</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CFDTHLPCTR</name>
                    <description>TX History List Pointer Control Registers</description>
                    <addressOffset>0x00A0</addressOffset>
                    <size>32</size>
                    <access>write-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>THLPC</name>
                            <description>TX History List Pointer Control</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>The write value should be 000000000000000000000000.</description>
                            <lsb>8</lsb>
                            <msb>31</msb>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
