ra-rs/ra/svd/vendor/R7FA8M1AH.svd
                <register>
                    <dim>16</dim>
                    <dimIncrement>0x0004</dimIncrement>
                    <dimIndex>0-15</dimIndex>
                    <name>CFDRMDF27_%s</name>
                    <description>RX Message Buffer Data Field p Registers</description>
                    <addressOffset>0x1610</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>RMDB108</name>
                            <description>RX Message Buffer Data Byte ((p*q)+(q-4))</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RMDB109</name>
                            <description>RX Message Buffer Data Byte ((p*q)+(q-3))</description>
                            <lsb>8</lsb>
                            <msb>15</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Data Frame</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Remote Frame</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>RMDB110</name>
                            <description>RX Message Buffer Data Byte ((p*q)+(q-2))</description>
                            <lsb>16</lsb>
                            <msb>23</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Data Frame</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Remote Frame</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>RMDB111</name>
                            <description>RX Message Buffer Data Byte ((p*q)+(q-1))</description>
                            <lsb>24</lsb>
                            <msb>31</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Data Frame</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Remote Frame</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>16</dim>
                    <dimIncrement>0x0004</dimIncrement>
                    <dimIndex>0-15</dimIndex>
                    <name>CFDRMDF28_%s</name>
                    <description>RX Message Buffer Data Field p Registers</description>
                    <addressOffset>0x165C</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>RMDB112</name>
                            <description>RX Message Buffer Data Byte ((p*q)+(q-4))</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RMDB113</name>
                            <description>RX Message Buffer Data Byte ((p*q)+(q-3))</description>
                            <lsb>8</lsb>
                            <msb>15</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Data Frame</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Remote Frame</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>RMDB114</name>
                            <description>RX Message Buffer Data Byte ((p*q)+(q-2))</description>
                            <lsb>16</lsb>
                            <msb>23</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Data Frame</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Remote Frame</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>RMDB115</name>
                            <description>RX Message Buffer Data Byte ((p*q)+(q-1))</description>
                            <lsb>24</lsb>
                            <msb>31</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Data Frame</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Remote Frame</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>16</dim>
                    <dimIncrement>0x0004</dimIncrement>
                    <dimIndex>0-15</dimIndex>
                    <name>CFDRMDF29_%s</name>
                    <description>RX Message Buffer Data Field p Registers</description>
                    <addressOffset>0x16A8</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>RMDB116</name>
                            <description>RX Message Buffer Data Byte ((p*q)+(q-4))</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RMDB117</name>
                            <description>RX Message Buffer Data Byte ((p*q)+(q-3))</description>
                            <lsb>8</lsb>
                            <msb>15</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Data Frame</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Remote Frame</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>RMDB118</name>
                            <description>RX Message Buffer Data Byte ((p*q)+(q-2))</description>
                            <lsb>16</lsb>
                            <msb>23</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Data Frame</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Remote Frame</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>RMDB119</name>
                            <description>RX Message Buffer Data Byte ((p*q)+(q-1))</description>
                            <lsb>24</lsb>
                            <msb>31</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Data Frame</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Remote Frame</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>16</dim>
                    <dimIncrement>0x0004</dimIncrement>
                    <dimIndex>0-15</dimIndex>
                    <name>CFDRMDF30_%s</name>
                    <description>RX Message Buffer Data Field p Registers</description>
                    <addressOffset>0x16F4</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>RMDB120</name>
                            <description>RX Message Buffer Data Byte ((p*q)+(q-4))</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RMDB121</name>
                            <description>RX Message Buffer Data Byte ((p*q)+(q-3))</description>
                            <lsb>8</lsb>
                            <msb>15</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Data Frame</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Remote Frame</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>RMDB122</name>
                            <description>RX Message Buffer Data Byte ((p*q)+(q-2))</description>
                            <lsb>16</lsb>
                            <msb>23</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Data Frame</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Remote Frame</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>RMDB123</name>
                            <description>RX Message Buffer Data Byte ((p*q)+(q-1))</description>
                            <lsb>24</lsb>
                            <msb>31</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Data Frame</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Remote Frame</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>16</dim>
                    <dimIncrement>0x0004</dimIncrement>
                    <dimIndex>0-15</dimIndex>
                    <name>CFDRMDF31_%s</name>
                    <description>RX Message Buffer Data Field p Registers</description>
                    <addressOffset>0x1740</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>RMDB124</name>
                            <description>RX Message Buffer Data Byte ((p*q)+(q-4))</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RMDB125</name>
                            <description>RX Message Buffer Data Byte ((p*q)+(q-3))</description>
                            <lsb>8</lsb>
                            <msb>15</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Data Frame</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Remote Frame</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>RMDB126</name>
                            <description>RX Message Buffer Data Byte ((p*q)+(q-2))</description>
                            <lsb>16</lsb>
                            <msb>23</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Data Frame</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Remote Frame</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>RMDB127</name>
                            <description>RX Message Buffer Data Byte ((p*q)+(q-1))</description>
                            <lsb>24</lsb>
                            <msb>31</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Data Frame</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Remote Frame</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>2</dim>
                    <dimIncrement>0x004C</dimIncrement>
                    <dimIndex>0-1</dimIndex>
                    <name>CFDRFIDE%s</name>
                    <description>RX FIFO Access ID Registers for Emulation</description>
                    <addressOffset>0x1920</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>RFID</name>
                            <description>RX FIFO Buffer ID Field</description>
                            <lsb>0</lsb>
                            <msb>28</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>This bit is read as 0.</description>
                            <lsb>29</lsb>
                            <msb>29</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RFRTR</name>
                            <description>RX FIFO Buffer RTR Bit</description>
                            <lsb>30</lsb>
                            <msb>30</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Data Frame</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Remote Frame</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>RFIDE</name>
                            <description>RX FIFO Buffer IDE Bit</description>
                            <lsb>31</lsb>
                            <msb>31</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>STD-ID has been received</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>EXT-ID has been received</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
