ra-rs/ra/svd/vendor/R7FA8M1AH.svd
                <register derivedFrom="P110PFS">
                    <name>P300PFS</name>
                    <description>P300 Pin Function Control Register</description>
                    <addressOffset>0x0C0</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00010010</resetValue>
                    <resetMask>0xFFFFFFFD</resetMask>
                </register>
                <register derivedFrom="P110PFS_HA">
                    <name>P300PFS_HA</name>
                    <description>P300 Pin Function Control Register</description>
                    <alternateRegister>P300PFS</alternateRegister>
                    <addressOffset>0x0C0</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0010</resetValue>
                    <resetMask>0xFFFD</resetMask>
                </register>
                <register derivedFrom="P110PFS_BY">
                    <name>P300PFS_BY</name>
                    <description>P300 Pin Function Control Register</description>
                    <alternateRegister>P300PFS</alternateRegister>
                    <addressOffset>0x0C0</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x10</resetValue>
                    <resetMask>0xFD</resetMask>
                </register>
                <register derivedFrom="P000PFS">
                    <dim>9</dim>
                    <dimIncrement>0x4</dimIncrement>
                    <dimIndex>1-9</dimIndex>
                    <name>P30%sPFS</name>
                    <description>P30%s Pin Function Control Register</description>
                    <addressOffset>0x0C4</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFD</resetMask>
                </register>
                <register derivedFrom="P000PFS_HA">
                    <dim>9</dim>
                    <dimIncrement>0x4</dimIncrement>
                    <dimIndex>1-9</dimIndex>
                    <name>P30%sPFS_HA</name>
                    <description>P30%s Pin Function Control Register</description>
                    <alternateRegister>P30%sPFS</alternateRegister>
                    <addressOffset>0x0C4</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xFFFD</resetMask>
                </register>
                <register derivedFrom="P000PFS_BY">
                    <dim>9</dim>
                    <dimIncrement>0x4</dimIncrement>
                    <dimIndex>1-9</dimIndex>
                    <name>P30%sPFS_BY</name>
                    <description>P30%s Pin Function Control Register</description>
                    <alternateRegister>P30%sPFS</alternateRegister>
                    <addressOffset>0x0C4</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFD</resetMask>
                </register>
                <register derivedFrom="P000PFS">
                    <dim>6</dim>
                    <dimIncrement>0x4</dimIncrement>
                    <dimIndex>10-15</dimIndex>
                    <name>P3%sPFS</name>
                    <description>P3%s Pin Function Control Register</description>
                    <addressOffset>0x0E8</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFD</resetMask>
                </register>
                <register derivedFrom="P000PFS_HA">
                    <dim>6</dim>
                    <dimIncrement>0x4</dimIncrement>
                    <dimIndex>10-15</dimIndex>
                    <name>P3%sPFS_HA</name>
                    <description>P30%s Pin Function Control Register</description>
                    <alternateRegister>P3%sPFS</alternateRegister>
                    <addressOffset>0x0E8</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xFFFD</resetMask>
                </register>
                <register derivedFrom="P000PFS_BY">
                    <dim>6</dim>
                    <dimIncrement>0x4</dimIncrement>
                    <dimIndex>10-15</dimIndex>
                    <name>P3%sPFS_BY</name>
                    <description>P30%s Pin Function Control Register</description>
                    <alternateRegister>P3%sPFS</alternateRegister>
                    <addressOffset>0x0E8</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFD</resetMask>
                </register>
                <register derivedFrom="P100PFS">
                    <dim>10</dim>
                    <dimIncrement>0x4</dimIncrement>
                    <dimIndex>0-9</dimIndex>
                    <name>P40%sPFS</name>
                    <description>P40%s Pin Function Control Register</description>
                    <addressOffset>0x100</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFD</resetMask>
                </register>
                <register derivedFrom="P100PFS_HA">
                    <dim>10</dim>
                    <dimIncrement>0x4</dimIncrement>
                    <dimIndex>0-9</dimIndex>
                    <name>P40%sPFS_HA</name>
                    <description>P40%s Pin Function Control Register</description>
                    <alternateRegister>P40%sPFS</alternateRegister>
                    <addressOffset>0x100</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xFFFD</resetMask>
                </register>
                <register derivedFrom="P100PFS_BY">
                    <dim>10</dim>
                    <dimIncrement>0x4</dimIncrement>
                    <dimIndex>0-9</dimIndex>
                    <name>P40%sPFS_BY</name>
                    <description>P40%s Pin Function Control Register</description>
                    <alternateRegister>P40%sPFS</alternateRegister>
                    <addressOffset>0x100</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFD</resetMask>
                </register>
