ra-rs/ra/svd/vendor/R7FA8M1AH.svd
            </registers>
        </peripheral>
        <peripheral derivedFrom="RMPU">
            <name>RMPU_NS</name>
            <description>Renesas Memory Protection Unit as Non-secure</description>
            <baseAddress>0x50000000</baseAddress>
        </peripheral>
        <peripheral derivedFrom="SRAM">
            <name>SRAM_NS</name>
            <description>SRAM Control as Non-secure</description>
            <baseAddress>0x50002000</baseAddress>
        </peripheral>
        <peripheral derivedFrom="BUS">
            <name>BUS_NS</name>
            <description>BUS Control as Non-secure</description>
            <baseAddress>0x50003000</baseAddress>
        </peripheral>
        <peripheral derivedFrom="TZF">
            <name>TZF_NS</name>
            <description>TrustZone Filter as Non-secure</description>
            <baseAddress>0x50004000</baseAddress>
        </peripheral>
        <peripheral derivedFrom="ICU_COMMON">
            <name>ICU_COMMON_NS</name>
            <description>Common Interrupt Controller as Non-secure</description>
            <baseAddress>0x50006000</baseAddress>
        </peripheral>
        <peripheral derivedFrom="CPSCU">
            <name>CPSCU_NS</name>
            <description>CPU System Security Control Unit as Non-secure</description>
            <baseAddress>0x50008000</baseAddress>
        </peripheral>
        <peripheral derivedFrom="DMAC0">
            <name>DMAC0_NS</name>
            <description>Direct memory access controller 0 as Non-secure</description>
            <baseAddress>0x5000A000</baseAddress>
        </peripheral>
        <peripheral derivedFrom="DMAC0">
            <name>DMAC1_NS</name>
            <description>Direct memory access controller 1 as Non-secure</description>
            <baseAddress>0x5000A040</baseAddress>
        </peripheral>
        <peripheral derivedFrom="DMAC0">
            <name>DMAC2_NS</name>
            <description>Direct memory access controller 2 as Non-secure</description>
            <baseAddress>0x5000A080</baseAddress>
        </peripheral>
        <peripheral derivedFrom="DMAC0">
            <name>DMAC3_NS</name>
            <description>Direct memory access controller 3 as Non-secure</description>
            <baseAddress>0x5000A0C0</baseAddress>
        </peripheral>
        <peripheral derivedFrom="DMAC0">
            <name>DMAC4_NS</name>
            <description>Direct memory access controller 4 as Non-secure</description>
            <baseAddress>0x5000A100</baseAddress>
        </peripheral>
        <peripheral derivedFrom="DMAC0">
            <name>DMAC5_NS</name>
            <description>Direct memory access controller 5 as Non-secure</description>
            <baseAddress>0x5000A140</baseAddress>
        </peripheral>
        <peripheral derivedFrom="DMAC0">
            <name>DMAC6_NS</name>
            <description>Direct memory access controller 6 as Non-secure</description>
            <baseAddress>0x5000A180</baseAddress>
        </peripheral>
        <peripheral derivedFrom="DMAC0">
            <name>DMAC7_NS</name>
            <description>Direct memory access controller 7 as Non-secure</description>
            <baseAddress>0x5000A1C0</baseAddress>
        </peripheral>
        <peripheral derivedFrom="DMA">
            <name>DMA_NS</name>
            <description>DMAC Module Activation as Non-secure</description>
            <baseAddress>0x5000A800</baseAddress>
        </peripheral>
        <peripheral derivedFrom="DTC">
            <name>DTC_NS</name>
            <description>Data Transfer Controller as Non-secure</description>
            <baseAddress>0x5000AC00</baseAddress>
        </peripheral>
        <peripheral derivedFrom="ICU">
            <name>ICU_NS</name>
            <description>Interrupt Controller as Non-secure</description>
            <baseAddress>0x5000C000</baseAddress>
        </peripheral>
        <peripheral derivedFrom="CPU_OCD">
            <name>CPU_OCD_NS</name>
            <description>On-Chip Debug as Non-secure</description>
            <baseAddress>0x50011000</baseAddress>
        </peripheral>
        <peripheral derivedFrom="CPU_DBG">
            <name>CPU_DBG_NS</name>
            <description>Debug Function as Non-secure</description>
            <baseAddress>0x5001B000</baseAddress>
        </peripheral>
        <peripheral derivedFrom="FCACHE">
            <name>FCACHE_NS</name>
            <description>Flash Cache as Non-secure</description>
            <baseAddress>0x5001C100</baseAddress>
        </peripheral>
        <peripheral derivedFrom="SYSC">
            <name>SYSC_NS</name>
            <description>System Control as Non-secure</description>
            <baseAddress>0x5001E000</baseAddress>
        </peripheral>
        <peripheral derivedFrom="TSD">
            <name>TSD_NS</name>
            <description>Temperature Sensor Data as Non-secure</description>
            <baseAddress>0x5011B17C</baseAddress>
        </peripheral>
        <peripheral derivedFrom="FLAD">
            <name>FLAD_NS</name>
            <description>Data Flash as Non-secure</description>
            <baseAddress>0x5011C000</baseAddress>
        </peripheral>
        <peripheral derivedFrom="FACI">
            <name>FACI_NS</name>
            <description>Flash Application Command Interface as Non-secure</description>
            <baseAddress>0x5011E000</baseAddress>
        </peripheral>
        <peripheral derivedFrom="ELC">
            <name>ELC_NS</name>
            <description>Event Link Controller as Non-secure</description>
            <baseAddress>0x50201000</baseAddress>
        </peripheral>
        <peripheral derivedFrom="RTC">
            <name>RTC_NS</name>
            <description>Realtime Clock as Non-secure</description>
            <baseAddress>0x50202000</baseAddress>
        </peripheral>
        <peripheral derivedFrom="IWDT">
            <name>IWDT_NS</name>
            <description>Independent Watchdog Timer as Non-secure</description>
            <baseAddress>0x50202200</baseAddress>
        </peripheral>
        <peripheral derivedFrom="CAC">
            <name>CAC_NS</name>
            <description>Clock Frequency Accuracy Measurement Circuit as Non-secure</description>
            <baseAddress>0x50202400</baseAddress>
        </peripheral>
        <peripheral derivedFrom="WDT">
            <name>WDT_NS</name>
            <description>Watchdog Timer as Non-secure</description>
            <baseAddress>0x50202600</baseAddress>
        </peripheral>
