ra-rs/ra/svd/vendor/R7FA8M1AH.svd
        <peripheral derivedFrom="MSTP">
            <name>MSTP_NS</name>
            <description>Module Stop Control A,B,C,D,E as Non-secure</description>
            <baseAddress>0x50203000</baseAddress>
        </peripheral>
        <peripheral derivedFrom="PSCU">
            <name>PSCU_NS</name>
            <description>Peripheral Security Control Unit as Non-secure</description>
            <baseAddress>0x50204000</baseAddress>
        </peripheral>
        <peripheral derivedFrom="POEG">
            <name>POEG_NS</name>
            <description>Port Output Enable Module for GPT as Non-secure</description>
            <baseAddress>0x50212000</baseAddress>
        </peripheral>
        <peripheral derivedFrom="ULPT0">
            <name>ULPT0_NS</name>
            <description>Ultra-Low Power Timer 0 as Non-secure</description>
            <baseAddress>0x50220000</baseAddress>
        </peripheral>
        <peripheral derivedFrom="ULPT0">
            <name>ULPT1_NS</name>
            <description>Ultra-Low Power Timer 1 as Non-secure</description>
            <baseAddress>0x50220100</baseAddress>
        </peripheral>
        <peripheral derivedFrom="AGT0">
            <name>AGT0_NS</name>
            <description>Low Power Asynchronous General purpose Timer 0 as Non-secure</description>
            <baseAddress>0x50221000</baseAddress>
        </peripheral>
        <peripheral derivedFrom="AGT0">
            <name>AGT1_NS</name>
            <description>Low Power Asynchronous General purpose Timer 1 as Non-secure</description>
            <baseAddress>0x50221100</baseAddress>
        </peripheral>
        <peripheral derivedFrom="TSN">
            <name>TSN_NS</name>
            <description>Temperature Sensor as Non-secure</description>
            <baseAddress>0x50235000</baseAddress>
        </peripheral>
        <peripheral derivedFrom="ACMPHS0">
            <name>ACMPHS0_NS</name>
            <description>High-Speed Analog Comparator 0 as Non-secure</description>
            <baseAddress>0x50236000</baseAddress>
        </peripheral>
        <peripheral derivedFrom="ACMPHS0">
            <name>ACMPHS1_NS</name>
            <description>High-Speed Analog Comparator 1 as Non-secure</description>
            <baseAddress>0x50236100</baseAddress>
        </peripheral>
        <peripheral derivedFrom="USBFS">
            <name>USBFS_NS</name>
            <description>USB 2.0 FS Module as Non-secure</description>
            <baseAddress>0x50250000</baseAddress>
        </peripheral>
        <peripheral derivedFrom="SDHI0">
            <name>SDHI0_NS</name>
            <description>SD Host Interface 0 as Non-secure</description>
            <baseAddress>0x50252000</baseAddress>
        </peripheral>
        <peripheral derivedFrom="SDHI0">
            <name>SDHI1_NS</name>
            <description>SD Host Interface 1 as Non-secure</description>
            <baseAddress>0x50252400</baseAddress>
        </peripheral>
        <peripheral derivedFrom="SSIE0">
            <name>SSIE0_NS</name>
            <description>Serial Sound Interface Enhanced (SSIE) as Non-secure</description>
            <baseAddress>0x5025D000</baseAddress>
        </peripheral>
        <peripheral derivedFrom="SSIE0">
            <name>SSIE1_NS</name>
            <description>Serial Sound Interface Enhanced (SSIE) as Non-secure</description>
            <baseAddress>0x5025D100</baseAddress>
        </peripheral>
        <peripheral derivedFrom="IIC0">
            <name>IIC0_NS</name>
            <description>Inter-Integrated Circuit 0 as Non-secure</description>
            <baseAddress>0x5025E000</baseAddress>
        </peripheral>
        <peripheral derivedFrom="IIC0WU">
            <name>IIC0WU_NS</name>
            <description>Inter-Integrated Circuit 0 Wake-up Unit as Non-secure</description>
            <baseAddress>0x5025E014</baseAddress>
        </peripheral>
        <peripheral derivedFrom="IIC1">
            <name>IIC1_NS</name>
            <description>Inter-Integrated Circuit 1 as Non-secure</description>
            <baseAddress>0x5025E100</baseAddress>
        </peripheral>
        <peripheral derivedFrom="xSPI">
            <name>xSPI_NS</name>
            <description>eXpanded SPI as Non-secure</description>
            <baseAddress>0x50268000</baseAddress>
        </peripheral>
        <peripheral derivedFrom="CRC">
            <name>CRC_NS</name>
            <description>CRC Calculator as Non-secure</description>
            <baseAddress>0x50310000</baseAddress>
        </peripheral>
        <peripheral derivedFrom="DOC">
            <name>DOC_NS</name>
            <description>Data Operation Circuit-4 as Non-secure</description>
            <baseAddress>0x50311000</baseAddress>
        </peripheral>
        <peripheral derivedFrom="GPT320">
            <name>GPT320_NS</name>
            <description>General PWM 32-bit Timer 0 as Non-secure</description>
            <baseAddress>0x50322000</baseAddress>
        </peripheral>
        <peripheral derivedFrom="GPT320">
            <name>GPT321_NS</name>
            <description>General PWM 32-bit Timer 1 as Non-secure</description>
            <baseAddress>0x50322100</baseAddress>
        </peripheral>
        <peripheral derivedFrom="GPT320">
            <name>GPT322_NS</name>
            <description>General PWM 32-bit Timer 2 as Non-secure</description>
            <baseAddress>0x50322200</baseAddress>
        </peripheral>
        <peripheral derivedFrom="GPT320">
            <name>GPT323_NS</name>
            <description>General PWM 32-bit Timer 3 as Non-secure</description>
            <baseAddress>0x50322300</baseAddress>
        </peripheral>
        <peripheral derivedFrom="GPT320">
            <name>GPT324_NS</name>
            <description>General PWM 32-bit Timer 4 as Non-secure</description>
            <baseAddress>0x50322400</baseAddress>
        </peripheral>
        <peripheral derivedFrom="GPT320">
            <name>GPT325_NS</name>
            <description>General PWM 32-bit Timer 5 as Non-secure</description>
            <baseAddress>0x50322500</baseAddress>
        </peripheral>
        <peripheral derivedFrom="GPT320">
            <name>GPT326_NS</name>
            <description>General PWM 32-bit Timer 6 as Non-secure</description>
            <baseAddress>0x50322600</baseAddress>
        </peripheral>
        <peripheral derivedFrom="GPT320">
            <name>GPT327_NS</name>
            <description>General PWM 32-bit Timer 7 as Non-secure</description>
            <baseAddress>0x50322700</baseAddress>
        </peripheral>
        <peripheral derivedFrom="GPT320">
            <name>GPT168_NS</name>
            <description>General PWM 16-bit Timer 8 as Non-secure</description>
            <baseAddress>0x50322800</baseAddress>
        </peripheral>
        <peripheral derivedFrom="GPT320">
            <name>GPT169_NS</name>
            <description>General PWM 16-bit Timer 9 as Non-secure</description>
            <baseAddress>0x50322900</baseAddress>
        </peripheral>
        <peripheral derivedFrom="GPT320">
            <name>GPT1610_NS</name>
            <description>General PWM 16-bit Timer 10 as Non-secure</description>
            <baseAddress>0x50322A00</baseAddress>
        </peripheral>
        <peripheral derivedFrom="GPT320">
            <name>GPT1611_NS</name>
            <description>General PWM 16-bit Timer 11 as Non-secure</description>
            <baseAddress>0x50322B00</baseAddress>
        </peripheral>
        <peripheral derivedFrom="GPT320">
            <name>GPT1612_NS</name>
            <description>General PWM 16-bit Timer 12 as Non-secure</description>
            <baseAddress>0x50322C00</baseAddress>
        </peripheral>
        <peripheral derivedFrom="GPT320">
            <name>GPT1613_NS</name>
            <description>General PWM 16-bit Timer 13 as Non-secure</description>
            <baseAddress>0x50322D00</baseAddress>
        </peripheral>
        <peripheral derivedFrom="GPT_OPS">
            <name>GPT_OPS_NS</name>
            <description>Output Phase Switching Controller as Non-secure</description>
            <baseAddress>0x50323F00</baseAddress>
        </peripheral>
        <peripheral derivedFrom="ADC120">
            <name>ADC120_NS</name>
            <description>12bit A/D Converter 0 as Non-secure</description>
            <baseAddress>0x50332000</baseAddress>
        </peripheral>
        <peripheral derivedFrom="ADC121">
            <name>ADC121_NS</name>
            <description>12bit A/D Converter 1 as Non-secure</description>
            <baseAddress>0x50332200</baseAddress>
        </peripheral>
