ra-rs/ra/svd/vendor/R7FA8M1AH.svd
        <peripheral derivedFrom="DAC12">
            <name>DAC12_NS</name>
            <description>12-bit D/A converter as Non-secure</description>
            <baseAddress>0x50333000</baseAddress>
        </peripheral>
        <peripheral derivedFrom="GLCDC">
            <name>GLCDC_NS</name>
            <description>Graphics LCD Controller as Non-secure</description>
            <baseAddress>0x50342000</baseAddress>
        </peripheral>
        <peripheral derivedFrom="DRW">
            <name>DRW_NS</name>
            <description>2D Drawing Engine as Non-secure</description>
            <baseAddress>0x50344000</baseAddress>
        </peripheral>
        <peripheral derivedFrom="DSILINK">
            <name>DSILINK_NS</name>
            <description>DSI Link as Non-secure</description>
            <baseAddress>0x50346000</baseAddress>
        </peripheral>
        <peripheral derivedFrom="DPHYCNT">
            <name>DPHYCNT_NS</name>
            <description>D-PHY Controller Top as Non-secure</description>
            <baseAddress>0x50346C00</baseAddress>
        </peripheral>
        <peripheral derivedFrom="CEU">
            <name>CEU_NS</name>
            <description>Capture Engine Unit as Non-secure</description>
            <baseAddress>0x50348000</baseAddress>
        </peripheral>
        <peripheral derivedFrom="USBHS">
            <name>USBHS_NS</name>
            <description>USB 2.0 High-Speed Module as Non-secure</description>
            <baseAddress>0x50351000</baseAddress>
        </peripheral>
        <peripheral derivedFrom="EDMAC0">
            <name>EDMAC0_NS</name>
            <description>DMA Controller for the Ethernet Controller Channel 0 as Non-secure</description>
            <baseAddress>0x50354000</baseAddress>
        </peripheral>
        <peripheral derivedFrom="ETHERC0">
            <name>ETHERC0_NS</name>
            <description>Ethernet Controller Channel 0 as Non-secure</description>
            <baseAddress>0x50354100</baseAddress>
        </peripheral>
        <peripheral derivedFrom="SCI0">
            <name>SCI0_NS</name>
            <description>Serial Communication Interface 0 as Non-secure</description>
            <baseAddress>0x50358000</baseAddress>
        </peripheral>
        <peripheral derivedFrom="SCI0">
            <name>SCI1_NS</name>
            <description>Serial Communication Interface 1 as Non-secure</description>
            <baseAddress>0x50358100</baseAddress>
        </peripheral>
        <peripheral derivedFrom="SCI0">
            <name>SCI2_NS</name>
            <description>Serial Communication Interface 2 as Non-secure</description>
            <baseAddress>0x50358200</baseAddress>
        </peripheral>
        <peripheral derivedFrom="SCI0">
            <name>SCI3_NS</name>
            <description>Serial Communication Interface 3 as Non-secure</description>
            <baseAddress>0x50358300</baseAddress>
        </peripheral>
        <peripheral derivedFrom="SCI0">
            <name>SCI4_NS</name>
            <description>Serial Communication Interface 4 as Non-secure</description>
            <baseAddress>0x50358400</baseAddress>
        </peripheral>
        <peripheral derivedFrom="SCI0">
            <name>SCI9_NS</name>
            <description>Serial Communication Interface 9 as Non-secure</description>
            <baseAddress>0x50358900</baseAddress>
        </peripheral>
        <peripheral derivedFrom="SPI0">
            <name>SPI0_NS</name>
            <description>Serial Peripheral Interface 0 as Non-secure</description>
            <baseAddress>0x5035C000</baseAddress>
        </peripheral>
        <peripheral derivedFrom="SPI0">
            <name>SPI1_NS</name>
            <description>Serial Peripheral Interface 1 as Non-secure</description>
            <baseAddress>0x5035C100</baseAddress>
        </peripheral>
        <peripheral derivedFrom="I3C">
            <name>I3C_NS</name>
            <description>I2C I3C unified IP as Non-secure</description>
            <baseAddress>0x5035F000</baseAddress>
        </peripheral>
        <peripheral derivedFrom="ECCMB0">
            <name>ECCMB0_NS</name>
            <description>Error correction circuit for MBRAM0 as Non-secure</description>
            <baseAddress>0x5036F200</baseAddress>
        </peripheral>
        <peripheral derivedFrom="ECCMB0">
            <name>ECCMB1_NS</name>
            <description>Error correction circuit for MBRAM1 as Non-secure</description>
            <baseAddress>0x5036F300</baseAddress>
        </peripheral>
        <peripheral derivedFrom="CANFD0">
            <name>CANFD0_NS</name>
            <description>CANFD Module 0 as Non-secure</description>
            <baseAddress>0x50380000</baseAddress>
        </peripheral>
        <peripheral derivedFrom="CANFD0">
            <name>CANFD1_NS</name>
            <description>CANFD Module 1 as Non-secure</description>
            <baseAddress>0x50382000</baseAddress>
        </peripheral>
        <peripheral derivedFrom="PORT0">
            <name>PORT0_NS</name>
            <description>Port 0 Control Registers as Non-secure</description>
            <baseAddress>0x50400000</baseAddress>
        </peripheral>
        <peripheral derivedFrom="PORT1">
            <name>PORT1_NS</name>
            <description>Port 1 Control Registers as Non-secure</description>
            <baseAddress>0x50400020</baseAddress>
        </peripheral>
        <peripheral derivedFrom="PORT1">
            <name>PORT2_NS</name>
            <description>Port 2 Control Registers as Non-secure</description>
            <baseAddress>0x50400040</baseAddress>
        </peripheral>
        <peripheral derivedFrom="PORT1">
            <name>PORT3_NS</name>
            <description>Port 3 Control Registers as Non-secure</description>
            <baseAddress>0x50400060</baseAddress>
        </peripheral>
        <peripheral derivedFrom="PORT1">
            <name>PORT4_NS</name>
            <description>Port 4 Control Registers as Non-secure</description>
            <baseAddress>0x50400080</baseAddress>
        </peripheral>
